import React from 'react';

const ForumRulesSection = () => {
    return (
        <>
            <div className="subsection">
                <h3>✅ Критерии проверки рапортов</h3>
                <ul className="list-disc pl-5 space-y-2">
                    <li>Рапорт должен быть оформлен также как и в форме</li>
                    <li>Цвет должен быть малиновым, как в форме рапорта</li>
                    <li>ФИО должно быть написано в родительном падеже (<strong>Пример:</strong> от Гуткова Данила Анатольевича)</li>
                    <li>Должность должна быть написана в родительном падеже (<strong>Пример:</strong> от Начальника Генерального Штаба)</li>
                    <li>Должность должна быть расшифрована полностью</li>
                    <li>Проверяем интервалы в подразделениях</li>
                </ul>
            </div>
        </>
    );
};

export default ForumRulesSection;