import React from 'react';
import ExamplePhrase from "@/app/components/Manual/ExamplePhrase";

const LecturesSection = () => {
    return (
        <>
            <div className="subsection">
                <h3>📍 Место проведения</h3>
                <p>Все лекции проводятся непосредственно в учебной классе Казармы.</p>
            </div>
            <div className="subsection">
                <h3>💬 Обязанности военнослужащих</h3>
                <ExamplePhrase text="s Здравия желаю. Сейчас я прочитаю лекцию об обязанностях военнослужащих." />
                <ExamplePhrase text="s Основные обязанности военнослужащих таковы:" />
                <ExamplePhrase text="s Мужественно, смелость, не щадя своей жизни выполнять воинский долг." />
                <ExamplePhrase text="s Стойко переносить трудности военной службы." />
                <ExamplePhrase text="s Быть честным, дисциплинированным, храбрым, при выполнении воинского долга." />
                <ExamplePhrase text="s Проявлять разумную инициативу." />
                <ExamplePhrase text="s Соблюдать правила воинской вежливости, поведения и выполнения воинского приветствия." />
                <ExamplePhrase text="s Беспрекословно подчиняться приказам командиров." />
                <ExamplePhrase text="s Оказывать уважение друг к другу, содействовать командирам и старшим по званию в поддержании порядка и дисциплины." />
                <ExamplePhrase text="s Честно выполнять порученную боевую или иную задачу." />
                <ExamplePhrase text="s Знать должности, воинские звания и фамилии своих прямых командиров." />
                <ExamplePhrase text="s С достоинством вести себя в общественных местах не допускать самому и удерживать" />
                <ExamplePhrase text="s других от недостойных поступков, содействовать защите чести и достоинства граждан." />
                <ExamplePhrase text="s Лекция окончена. Спасибо за внимание!" />
            </div>

            <div className="subsection">
                <h3>💬 Запреты для военнослужащих</h3>
                <ExamplePhrase text="s Сейчас я прочту лекцию на тему: &quot;Запреты для военнослужащих&quot;." />
                <ExamplePhrase text="s Военнослужащему запрещено:" />
                <ExamplePhrase text="s Допускать утрату боеприпасов, техники и любого иного военного имущества." />
                <ExamplePhrase text="s Допускать распространение служебной, военной, государственной тайны." />
                <ExamplePhrase text="s Обсуждать вопросы, связанные с присвоением воинских званий и должностей." />
                <ExamplePhrase text="s Самовольно покидать территорию Военной части." />
                <ExamplePhrase text="s Допускать пререкания или неподчинение старшему составу в рамках их прямых служебных полномочий." />
                <ExamplePhrase text="s Допускать проникновение неучтенных лиц на территорию воинской части." />
                <ExamplePhrase text="s Самовольно применять оружие в городе, за исключением случаев, самообороны и/или обороны военного имущества." />
                <ExamplePhrase text="s Появляться в нетрезвом виде на службе и в общественных местах, тем самым" />
                <ExamplePhrase text="s позоря честь и достоинство военнослужащего." />
                <ExamplePhrase text="s Входить в контакт и содействовать преступными/террористическими группировками." />
                <ExamplePhrase text="s Обманывать или вводить в заблуждение старший офицерский состав." />
                <ExamplePhrase text="s Осуществлять акт шпионажа, в том числе в интересах иных служб." />
                <ExamplePhrase text="s Покрывать любые нарушения Устава или законов иными военнослужащими." />
                <ExamplePhrase text="s Лекция окончена. Спасибо за внимание!" />
            </div>

            <div className="subsection">
                <h3>💬 Основные запреты на срочной службе</h3>
                <ExamplePhrase text="s Сейчас я расскажу лекцию о наказаниях за нарушение правил для срочного состава." />
                <ExamplePhrase text="s Все следующие правила регламентируются Уставом Министерства Обороны, с которым все обязаны ознакомиться!" />
                <ExamplePhrase text="s Каждый военнослужащий срочной службы обязан соблюдать все правила нахождения в армии:" />
                <ExamplePhrase text="s брать наряд в соответствии со званием;" />
                <ExamplePhrase text="s за несоблюдение правила будете отправлены в карцер" />
                <ExamplePhrase text="b либо выговор, решает старший состав." />
                <ExamplePhrase text="s На территории воинской части запрещены драки." />
                <ExamplePhrase text="b за несоблюдение правила вам выпишут выговор." />
                <ExamplePhrase text="s Запрещено находиться на территории КПП вне наряда." />
                <ExamplePhrase text="s За несоблюдение правила будете посажены в карцер." />
                <ExamplePhrase text="b либо выпишут выговор, решает старший состав." />
                <ExamplePhrase text="s Самое главное – нельзя спать более пяти минут в любое время суток, за это последует наказание" />
                <ExamplePhrase text="s Также нельзя спать в нарядах более одной минуты." />
                <ExamplePhrase text="s Любой военнослужащий срочной службы обязан беспрекословно подчиняться командованию…" />
                <ExamplePhrase text="s …а также, Курсовым Офицерам УБ." />
                <ExamplePhrase text="s Солдатам срочной службы запрещено находиться без дела в любое время суток, нигде не сидим…" />
                <ExamplePhrase text="s …не прячемся, и не скрываемся! Берите наряд – всем срочникам разрешён лишь Патруль Территории!" />
                <ExamplePhrase text="s Со звания Младшего Сержанта при условии нахождения в наряде Патруля хоть одного военнослужащего…" />
                <ExamplePhrase text="s …можно заступать на Охрану КПП." />
                <ExamplePhrase text="s Во время наряда запрещено заходить в Генеральный штаб, склад, медпункт, карцер, столовую, казарму." />
                <ExamplePhrase text="s Исключение — сдача оружия в казарме после наряда." />
                <ExamplePhrase text="s за несоблюдение правила будете посажены в карцер." />
                <ExamplePhrase text="s Также запрещено при любых обстоятельствах находиться на крышах ангаров, зданий." />
                <ExamplePhrase text="s На этом я закончу лекцию «Основные запреты на срочной службе»" />
            </div>

            <div className="subsection">
                <h3>💬 Правила поведения на КПП</h3>
                <ExamplePhrase text="s Сейчас я расскажу лекцию о правилах поведения на КПП." />
                <ExamplePhrase text="s На территории КПП запрещено:" />
                <ExamplePhrase text="s спать, курить, пить, передавать и брать вещи;" />
                <ExamplePhrase text="s включать любую неуместную анимацию без приказа." />
                <ExamplePhrase text="s Военнослужащий обязан:" />
                <ExamplePhrase text="s общаться с гражданами вежливо и уважительно, обращаться строго на &quot;Вы&quot;;" />
                <ExamplePhrase text="s проверять документы у всех гражданских, подходящих к КПП." />
                <ExamplePhrase text="s Проверка только гражданского автотранспорта, пытающегося попасть на территорию Воинской части..." />
                <ExamplePhrase text="s на наличие подозрительных, взрывоопасных или запрещенных предметов" />
                <ExamplePhrase text="s Лекция закончена! Спасибо за внимание!" />
            </div>

            <div className="subsection">
                <h3>💬 График работы гос. фракций</h3>
                <ExamplePhrase text="s Сейчас я расскажу лекцию о режиме работы в армии." />
                <ExamplePhrase text="s С понедельника по пятницу смена начинается в 9:00 по МСК, заканчивается в 21:00." />
                <ExamplePhrase text="s Время для перерыва:" />
                <ExamplePhrase text="s обед - с 12:00 до 13:00" />
                <ExamplePhrase text="s ужин - с 16:00 до 17:00" />
                <ExamplePhrase text="s В выходные дни смена начинается в 11:00, заканчивается в 19:00." />
                <ExamplePhrase text="s Время для перерывов не меняется." />
                <ExamplePhrase text="s Сотрудник, сдавший смену, обязан покинуть территорию ВЧ." />
                <ExamplePhrase text="s Разрешено заходить на территорию ВЧ для того, чтобы заступить на смену," />
                <ExamplePhrase text="s либо направиться в столовую или в госпиталь, после чего покинуть территорию." />
                <ExamplePhrase text="s При других условиях нахождение на территории ВЧ вне смены является нарушением." />
                <ExamplePhrase text="s Лекция закончена! Не нарушайте!" />
            </div>

            <div className="subsection">
                <h3>💬 Звания МО</h3>
                <ExamplePhrase text="s Сейчас пройдет лекция на тему &quot;Звания Министерства Обороны&quot;!" />
                <ExamplePhrase text="s Всего в Министерстве Обороны насчитывается 11 званий." />
                <ExamplePhrase text="s Срочная служба:" />
                <ExamplePhrase text="s 1 - Рядовой" />
                <ExamplePhrase text="s 2 - Ефрейтор" />
                <ExamplePhrase text="s 3 - Мл. Сержант" />
                <ExamplePhrase text="s Младший состав:" />
                <ExamplePhrase text="s 4 - Прапорщик" />
                <ExamplePhrase text="s 5 - Лейтенант" />
                <ExamplePhrase text="s 6 - Ст. Лейтенант" />
                <ExamplePhrase text="s Средний состав:" />
                <ExamplePhrase text="s 7 - Капитан" />
                <ExamplePhrase text="s 8 - Майор (Инструктор подразделения)." />
                <ExamplePhrase text="s Cтарший состав:" />
                <ExamplePhrase text="s 9 - Полковник (Заместитель и Командир подразделения)." />
                <ExamplePhrase text="s 10 - Генерал (Заместитель Маршала)." />
                <ExamplePhrase text="s 11 - Маршал (Руководство Министерства Обороны)." />
                <ExamplePhrase text="s На этом лекция на тему &quot;Звания Министерства Обороны&quot; окончена!" />
            </div>

            <div className="subsection">
                <h3>💬 Должности СС МО</h3>
                <ExamplePhrase text="s Сейчас пройдет лекция на тему &quot;Должности старшего состава&quot;!" />
                <ExamplePhrase text="s Начнем нашу лекцию с ознакомления ВрИО срока!" />
                <ExamplePhrase text="s При становлении в старший состав, сотрудник является ВрИО Своей должности и имеет все теже самое что и без ВрИО." />
                <ExamplePhrase text="s Во время ВрИО срока, сотрудник имеет ." />
                <ExamplePhrase text="s Общее ознакомление на это окончено. Прейдем к более подобному разбору!" />
                <ExamplePhrase text="s Заместители Командиров подразделений - Полковник, их задача состоит в помощи Командирам подразделений." />
                <ExamplePhrase text="s Командиры подразделений - Полковники, отвечают за проверку отчетов сотрудников на повышение, отработку и т.д." />
                <ExamplePhrase text="s Заместители Маршала - Генералы, отвечают за проведение призывов, принятие и увольнение сотрудников и их перевод." />
                <ExamplePhrase text="s Всего существует 4 Генерала:" />
                <ExamplePhrase text="s Начальник ПВПП - 4 Заместитель Маршала." />
                <ExamplePhrase text="s Начальник ШГО - 3 Заместитель Маршала." />
                <ExamplePhrase text="s Начальник Штаба - 2 Заместитель Маршала." />
                <ExamplePhrase text="s Начальник Гарнизона - 1 Заместитель Маршала." />
                <ExamplePhrase text="s Начальник Генерального Штаба - Маршал." />
                <ExamplePhrase text="s На этом лекция на тему &quot;Должности старшего состава&quot; окончена!" />
            </div>

            <div className="subsection">
                <h3>💬 Арсенал</h3>
                <ExamplePhrase text="s Сейчас пройдет лекция на тему: &quot;Вооружение&quot;!" />
                <ExamplePhrase text="s Все вооружение Министерства Обороны хранится на складе, который расположен у полигона." />
                <ExamplePhrase text="s Другое и менее распространенное название склада - КХО (Комната хранения оружия)." />
                <ExamplePhrase text="s При захождении на смену, каждый военнослужащий обязан взять аммуницую, которая ему доступна!" />
                <ExamplePhrase text="s На складе имеются следующие виды оружия:" />
                <ExamplePhrase text="s 1 - Бронежилет. Доступен всем военнослужищим." />
                <ExamplePhrase text="s 2 - Пистолет &quot;Макарова&quot;. Доступен всем военнослужащим." />
                <ExamplePhrase text="s 3 - Пистолет &quot;МП-443 Грач&quot;. Доступен военнослужащим со званием Лейтенанта." />
                <ExamplePhrase text="s 4 - Автомат &quot;АК-74м&quot;. Доступен военнослужащим со Капитана." />
                <ExamplePhrase text="s 5 - Винтовка &quot;СВД&quot;. Доступна военнослужащим со званием Генерал." />
                <ExamplePhrase text="s Также доступна во время наряда &quot;Часовой на вышке&quot; всем сотрудникам подразделения &quot;ССО&quot;." />
                <ExamplePhrase text="s 6 - Парашют. Доступен для военнослужащих летных подразделений." />
                <ExamplePhrase text="s 7 - &quot;Тазер&quot;, &quot;Нож&quot; и &quot;РГД-42&quot;. Разрешено брать только с личного одобрения Маршала." />
                <ExamplePhrase text="s За взятие и использование оружие не по званию военнослужащий будет наказан согласно Уставу МО." />
                <ExamplePhrase text="s На этом лекция на тему &quot;Вооружение&quot; окончена!" />
            </div>

            <div className="subsection">
                <h3>💬 Применение оружия</h3>
                <ExamplePhrase text="s Сейчас я расскажу лекцию о применении оружия." />
                <ExamplePhrase text="s Военнослужащий обязан брать оружие в соответствии со званием." />
                <ExamplePhrase text="s Огонь без предупреждения разрешен в случаях, если…" />
                <ExamplePhrase text="s гражданин игнорирует действия проверки документов, транспорта;" />
                <ExamplePhrase text="s имеется угроза жизни военнослужащего;" />
                <ExamplePhrase text="s гражданин проник на воинскую часть;" />
                <ExamplePhrase text="s гражданин перекрыл проезд, игнорирует убрать транспорт;" />
                <ExamplePhrase text="s руководствуясь предыдущими предупреждениями," />
                <ExamplePhrase text="s то есть, после первых предупреждений не прошло 30 минут, а гражданин снова нарушает правила." />
                <ExamplePhrase text="s Лекция закончена! Благодарю за внимание!" />
            </div>

            <div className="subsection">
                <h3>💬 Наряды</h3>
                <ExamplePhrase text="s Сейчас я расскажу вам о нарядах Министерства Обороны!" />
                <ExamplePhrase text="s Все наряды берутся в дальнем углу казармы." />
                <ExamplePhrase text="s При заступлении в наряд должен быть соответствующий доклад в рацию." />
                <ExamplePhrase text="s Об этих докладах вы можете более подробно узнать на Гос. Портале." />
                <ExamplePhrase text="s Существует всего 4 наряда:" />
                <ExamplePhrase text="s 1 - Патруль территории. Доступен со звания Рядового." />
                <ExamplePhrase text="s 2 - Часовой на вышке. Доступен со звания Ефрейтора при разрешении старшего состава." />
                <ExamplePhrase text="s 3 - Охрана пропускного пункта. Доступен со звания Мл. Сержанта, при условии того..." />
                <ExamplePhrase text="s что в наряде Патруль территории кто-то есть." />
                <ExamplePhrase text="s 4 - Уборка территории. Запрещено брать на любом звании! Выдается только в качестве наказания." />
                <ExamplePhrase text="s На этом лекция &quot;О нарядах&quot; окончена!" />
            </div>

            <div className="subsection">
                <h3>💬 Стратегия</h3>
                <ExamplePhrase text="s Сейчас Я расскажу лекцию «Основы современного общевойскового боя – Стратегия»" />
                <ExamplePhrase text="s Изучая наступательный бой, общая тактика разрабатывает способы его организации и…" />
                <ExamplePhrase text="s …ведения при прорыве обороны, преследовании отходящего противника…" />
                <ExamplePhrase text="s …наступлении с преодолением водных преград, способы организации и ведения…" />
                <ExamplePhrase text="s …встречного боя, особенности наступления ночью, в городе, на приморском направлении…" />
                <ExamplePhrase text="s …в горах, пустынях, северных районах, в лесу и т. Д." />
                <ExamplePhrase text="s При изучении оборонительного боя тактика разрабатывает вопросы организации и ведения обороны…" />
                <ExamplePhrase text="s …в тактическом звене, ведения оборонительного боя в особых условиях, в окружении и при отходе." />
                <ExamplePhrase text="s Общая тактика разрабатывает также вопросы передвижения войск и расположения их на месте." />
                <ExamplePhrase text="s Лекция Окончена! Благодарю за внимание!" />
            </div>

            <div className="subsection">
                <h3>💬 СГУ</h3>
                <ExamplePhrase text="say Лекция на тему &quot;Использование СГУ&quot;." />
                <ExamplePhrase text="say СГУ - это мощные звуковые спецсигналы, устанавливаемые на ТС работников спецслужб." />
                <ExamplePhrase text="say СГУ и маячки работают одновременно, это сделано для удобства." />
                <ExamplePhrase text="say Сирена с проблесковыми маячками включается исключительно в служебных целях!" />
                <ExamplePhrase text="say СГУ включается, для того чтобы привлечь внимание других водителей." />
                <ExamplePhrase text="say Сирена с проблесковыми маячками включается, чтобы Вам уступили дорогу," />
                <ExamplePhrase text="say Обратили на Вас внимание и тому подобное." />
                <ExamplePhrase text="say Сирена с проблесковыми маячками даёт вам право на несоблюдение ПДД." />
                <ExamplePhrase text="say Не соблюдать ПДД можно тогда, когда это никому ничем не угрожает." />
                <ExamplePhrase text="say За нарушение правил использования сирен и проблесковых маячков — наказание." />
                <ExamplePhrase text="say Включение СГУ в полном виде разрешено только в экстренных случаях." />
                <ExamplePhrase text="say Иначе дисциплинарное взыскание в какой-либо форме." />
                <ExamplePhrase text="b Маячка включают на кнопку J" />
                <ExamplePhrase text="say На этом лекция &quot;Использование СГУ&quot; окончена." />
            </div>

            <div className="subsection">
                <h3>💬 Езда в колонне</h3>
                <ExamplePhrase text="say Лекция на тему &quot;Колонна&quot;." />
                <ExamplePhrase text="say Сегодня я расскажу об этих правилах." />
                <ExamplePhrase text="say Начну с того, что запрещено делать при езде колонной." />
                <ExamplePhrase text="say Запрещено превышать общую скорость колонны, 60 км/ч." />
                <ExamplePhrase text="say Запрещено покидать колонну и обгонять участников колонны." />
                <ExamplePhrase text="say Требуется соблюдать правила дорожного движения." />
                <ExamplePhrase text="say За рулем автомобилей в колонне должны быть самые опытные водители." />
                <ExamplePhrase text="say У всех должны быть включены маячки, а звуковой сигнал при команде!" />
                <ExamplePhrase text="say На этом лекция на тему &quot;Колонна&quot; закончена." />
            </div>

            <div className="subsection">
                <h3>💬 Сопровождение колонны</h3>
                <ExamplePhrase text="s Сейчас я прочту лекцию на тему &quot;Сопровождение колонны&quot;." />
                <ExamplePhrase text="s Начнем с того, что запрещено делать при сопровождении колонны:" />
                <ExamplePhrase text="s Запрещено летать слишком низко над землей, доставляя неудобства колонне" />
                <ExamplePhrase text="s Запрещено покидать колонну, исключение: не далекие отклонения от колонны с целью осмотра местности" />
                <ExamplePhrase text="s За штурвалом вертолета должны находится исключительно сотрудники ВВС, а также старший состав." />
                <ExamplePhrase text="s Пилоты при надобности, должны оповещать колонну о помехе или дтп" />
                <ExamplePhrase text="s На этом лекция на тему &quot;Сопровождение колонны&quot; окончена" />
            </div>

            <div className="subsection">
                <h3>💬 Подразделение УБ</h3>
                <ExamplePhrase text="s Сейчас я расскажу вам о подразделении &quot;Учебный Батальон&quot;!" />
                <ExamplePhrase text="s Обязанностью данного подразделения является наблюдение за срочным составом и помощь в прохождении службы." />
                <ExamplePhrase text="s По мимо этого, военнослужащие Учебного Батальона могут и должны:" />
                <ExamplePhrase text="s 1 - Проводить различные мероприятия, лекции и тренировки для срочного состава." />
                <ExamplePhrase text="s 2 - Проводить строевую подготовку и другие учения, которые в дальнейшем пригодятся им по службе." />
                <ExamplePhrase text="s 3 - Осуществлять для них поездки в банк." />
                <ExamplePhrase text="s 4 - А так же помогать военнослужащим срочной службы, давая им различные советы и отвечая на их вопросы." />
                <ExamplePhrase text="s Всего в младшем и среднем составе Учебного Батальона существует 4 должности:" />
                <ExamplePhrase text="s 1 - Курсовой Офицер." />
                <ExamplePhrase text="s 2 - Инструктор Учебной группы." />
                <ExamplePhrase text="s 3 - Заместитель Командира УБ" />
                <ExamplePhrase text="s 4 - Командир Уб" />
                <ExamplePhrase text="s На этом ознакомление с подразделением &quot;Учебный Батальон&quot; окончено!" />
            </div>

            <div className="subsection">
                <h3>💬 Подразделение ССО</h3>
                <ExamplePhrase text="s Здравия желаю, бойцы. Сейчас будет проведена лекция об обязанностях сотрудников ССО." />
                <ExamplePhrase text="s Первое - это сухопутная охрана объектов бойцами ГНР." />
                <ExamplePhrase text="s Всего охраняемых объектов для группы ГНР три." />
                <ExamplePhrase text="s С ними можно ознакомиться на гос. портале." />
                <ExamplePhrase text="s Второе - это патрулирование объектов Отделом Сапёрной Деятельности." />
                <ExamplePhrase text="s Всего патрулируемых объектов для Сапёров четыре." />
                <ExamplePhrase text="s С ними так же можно ознакомиться на гос. портале." />
                <ExamplePhrase text="s Третье - разведка Старой воинской части снайперами-диверсантами." />
                <ExamplePhrase text="s Объект разведки только один - Старая воинская часть." />
                <ExamplePhrase text="s Четвёртое - это поставка грузов на военную часть или в МВД городов республики." />
                <ExamplePhrase text="s Производится поставка на КамАЗе, в портах г.Приволск и г.Невский." />
                <ExamplePhrase text="s И не забывайте что вы должны делать соответствующие доклады в рацию." />
                <ExamplePhrase text="s На этом лекция &quot;Обязанности сотрудников ССО&quot; окончена." />
            </div>

            <div className="subsection">
                <h3>💬 Подразделение ВП</h3>
                <ExamplePhrase text="s Сейчас я расскажу вам о подразделении &quot;Военная Полиция&quot;!" />
                <ExamplePhrase text="s Обязанностью данного подразделения является наблюдение за порядком в Республике!" />
                <ExamplePhrase text="s По мимо этого, военнослужащие Военной Полиции могут и должны:" />
                <ExamplePhrase text="s 1 - Проводить военное патрулирование." />
                <ExamplePhrase text="s 2 - Стоять на посту в указанной точке." />
                <ExamplePhrase text="s 3 - Проводить осмотр и тех. обслуживание наземной техники." />
                <ExamplePhrase text="s 4 - Следить за правопорядком и воинской дисциплиной;" />
                <ExamplePhrase text="s Всего в младшем, среднем и старшем составе Военной Полиции существует 8 должностей и 2 разряда:" />
                <ExamplePhrase text="s ИМИ:" />
                <ExamplePhrase text="s 1 - Младший Инспектор ИМИ." />
                <ExamplePhrase text="s 2 - Инспектор ИМИ." />
                <ExamplePhrase text="s ВАИ:" />
                <ExamplePhrase text="s 1 - Инспектор ВАИ." />
                <ExamplePhrase text="s 2 - Старший Инспектор ВАИ." />
                <ExamplePhrase text="s 3 - Инструктор ВП." />
                <ExamplePhrase text="s 5 - Замеситель Командира ВП." />
                <ExamplePhrase text="s 6 - Командир ВП." />
                <ExamplePhrase text="s На этом ознакомление с подразделением &quot;Военная Полиция&quot; окончено!" />
            </div>

            <div className="subsection">
                <h3>💬 Подразделение ВВС</h3>
                <ExamplePhrase text="s Сейчас я расскажу вам о подразделении &quot;Военно-Воздушные Силы&quot;!" />
                <ExamplePhrase text="s Обязанностью данного подразделения является наблюдение за порядком с воздуха!" />
                <ExamplePhrase text="s Так же, Военно-Воздушные Силы делятся на 2 группы - ТА и ША!" />
                <ExamplePhrase text="s По мимо этого, военнослужащие Военно-Воздушных Сил могут и должны:" />
                <ExamplePhrase text="s 1 - Перевозка грузов." />
                <ExamplePhrase text="s 2 - Воздушное патрулирование." />
                <ExamplePhrase text="s 3 - Осмотр воздушной техники." />
                <ExamplePhrase text="s Всего в младшем, среднем и старшем составе Военно-Воздушных Сил существует 9 должностей - 3 в ТА , 3 в ША и 3 в ВВС." />
                <ExamplePhrase text="s ТА:" />
                <ExamplePhrase text="s 1 - Лётчик-оператор." />
                <ExamplePhrase text="s 2 - Лётчик-штурман." />
                <ExamplePhrase text="s 3 - Старший Лётчик." />
                <ExamplePhrase text="s ША:" />
                <ExamplePhrase text="s 1 - Пилот 3-го класса." />
                <ExamplePhrase text="s 2 - Пилот 2-го класса." />
                <ExamplePhrase text="s 3 - Пилот 1-го класса." />
                <ExamplePhrase text="s ВВС:" />
                <ExamplePhrase text="s 1 - Инструктор ВВС." />
                <ExamplePhrase text="s 2 - Заместитель Командира ВВС." />
                <ExamplePhrase text="s 3 - Командир ВВС." />
                <ExamplePhrase text="s На этом ознакомление с подразделением &quot;Военно-Воздушные Силы&quot; окончено!" />
            </div>

            <div className="subsection">
                <h3>💬 Планировка ВЧ</h3>
                <ExamplePhrase text="s Сейчас я расскажу вам о планировке нашей Воинской Части!" />
                <ExamplePhrase text="s На въезде расположен КПП со шлагбаумом." />
                <ExamplePhrase text="s Открывать шлагбаум разрешено только по приказу старшего состава!" />
                <ExamplePhrase text="b Для открытия используется команда /armygate" />
                <ExamplePhrase text="s Рядом с КПП находится Вышка-№1." />
                <ExamplePhrase text="s Все остальные вышки идут в часовом порядке!" />
                <ExamplePhrase text="s Если после прохода через КПП, повернуть на право, то вы попадете на плац!" />
                <ExamplePhrase text="s Там проходят все построения." />
                <ExamplePhrase text="s Самое маленькое, двухэтажное здание возле плаца - Госпиталь." />
                <ExamplePhrase text="s Напротив госпиталя расположен Генеральный Штаб." />
                <ExamplePhrase text="s Входить туда разрешено только по приказу старшего состава!" />
                <ExamplePhrase text="s За штабом, около забора находится тренировочная площадка." />
                <ExamplePhrase text="s С право от тренеровочной площадки находиться столовая в ней вы можете утолить голод." />
                <ExamplePhrase text="s Последнее здание на плацу - Казарма." />
                <ExamplePhrase text="s В ней берутся все наряды, а в классе проводятся лекции!" />
                <ExamplePhrase text="s Так же там имееться раздевалка в который вы можете надеть форму спецназа и переодеться на гражданку." />
                <ExamplePhrase text="s За казармой расположена парковка, рядом с которой стоит полигон." />
                <ExamplePhrase text="s Около полигона есть спуск в подвал - это склад с вооружением!" />
                <ExamplePhrase text="s В самом дальнем углу ВЧ находится ангар, там берется военная техника." />
                <ExamplePhrase text="s На этом наше ознакомление с планировкой ВЧ окончено!" />
            </div>

            <div className="subsection">
                <h3>💬 Строевая подготовка</h3>
                <ExamplePhrase text="s Сейчас я прочту лекцию на тему «Строевая подготовка»." />
                <ExamplePhrase text="s Для начала все бойцы должны построиться в ровную шеренгу." />
                <ExamplePhrase text="s Самая первая команда: «Равняйсь!»" />
                <ExamplePhrase text="s После такой команды все, кроме первого в строю, должны повернуть голову в право." />
                <ExamplePhrase text="s Следующая команда: &quot;Смирно!&quot;." />
                <ExamplePhrase text="s Вы поворачиваете голову в исходное положение и неподвижно стоите." />
                <ExamplePhrase text="s Команда «Вольно!» дает возможность задать вопросы командиру." />
                <ExamplePhrase text="s После этого командир на усмотрение произносит такие команды, как:" />
                <ExamplePhrase text="s &quot;Налево!&quot;, &quot;Направо!&quot;, &quot;Кругом!&quot;, &quot;Шагом марш!&quot;, &quot;Бегом марш!&quot;, &quot;На месте стой!&quot;" />
                <ExamplePhrase text="s Также есть такие команды, как: «Левое плечо вперед!»" />
                <ExamplePhrase text="s После неё бойцы выставляют левое плечо вперед и поворачивают направо при ходьбе." />
                <ExamplePhrase text="s В точности наоборот все происходит после команды &quot;Правое плечо вперед!&quot;" />
                <ExamplePhrase text="s И главное – это слушать приказы командира!" />
                <ExamplePhrase text="s Когда объявили всеобщее построение, вы обязаны бросить все дела и явится." />
                <ExamplePhrase text="s Обращения в строю.  Боец в строю, услышав свою фамилию, должен ответить &quot;Я!&quot;" />
                <ExamplePhrase text="s Боец в строю, получивший приказ, должен ответить &quot;Есть!&quot; и приступить к выполнению." />
                <ExamplePhrase text="s Для обращения к организатору строя, военнослужащий спрашивает разрешение обратиться из строя по форме:" />
                <ExamplePhrase text="s Товарищ &quot;Звание&quot;, разрешите обратиться." />
                <ExamplePhrase text="s Когда организатор строя говорит &quot;Здравия желаю, бойцы!&quot; - военнослужащие должны стоять молча." />
                <ExamplePhrase text="s В строю запрещено: спать, разговаривать, пользоваться часами, держать оружие в руках." />
                <ExamplePhrase text="s Выражать эмоции, стрелять и покидать строй без разрешения." />
                <ExamplePhrase text="s Лекция окончена. Спасибо за внимание!" />
            </div>

            <div className="subsection">
                <h3>💬 Проведение тренировок</h3>
                <ExamplePhrase text="s Сейчас я расскажу лекцию о правилах проведения тренировок." />
                <ExamplePhrase text="s Военнослужащий контрактной службы обязан проводить тренировки срочному составу." />
                <ExamplePhrase text="s Это необходимо делать в целях соблюдения дисциплины," />
                <ExamplePhrase text="b а также повышений в званиях." />
                <ExamplePhrase text="s Перед началом необходимо объявить название тренировки:" />
                <ExamplePhrase text="s &quot;Сейчас пройдет тренировка &quot;Название&quot;." />
                <ExamplePhrase text="s После указать длительность, либо количество выполнений упражнения." />
                <ExamplePhrase text="s Пример:" />
                <ExamplePhrase text="s 10 раз под свой счет, либо 10 секунд, в зависимости от самой тренировки." />
                <ExamplePhrase text="s Тренировки бывают:" />
                <ExamplePhrase text="s Отжимания, планка, бег, прыжок в длину, в высоту, полоса препятствий, полтора, приседания." />
                <ExamplePhrase text="s Заканчиваются тренировки фразой:" />
                <ExamplePhrase text="s &quot;Тренировка &quot;Отжимания&quot; окончена.&quot;" />
                <ExamplePhrase text="b скрин делают в начале и в конце." />
                <ExamplePhrase text="s На этом лекция закончена! Спасибо за внимание!" />
            </div>

            <div className="subsection">
                <h3>💬 Субординация</h3>
                <ExamplePhrase text="say Тема лекции «Субординация»." />
                <ExamplePhrase text="say Субординация - следование правил взаимоотношений между лицами." />
                <ExamplePhrase text="say Она предусматривает уважительные отношения между начальником и подчинённым." />
                <ExamplePhrase text="say В гос. организациях правила субординации устанавливают порядок соблюдения определённых традиций." />
                <ExamplePhrase text="say Например, традиции воинского приветствия — выполнение воинского приветствия." />
                <ExamplePhrase text="say Так же к старшим по званию необходимо обращаться на &quot;Вы&quot;." />
                <ExamplePhrase text="say У нас нет слов &quot;Сэр/Мэм&quot; - есть только &quot;Товарищ звание&quot;." />
                <ExamplePhrase text="say Нет слов &quot;Да и Нет&quot; - есть только &quot;Так Точно! и Никак нет!&quot;" />
                <ExamplePhrase text="say Нет слов &quot;Хорошо и Ладно &quot; - есть только &quot;Есть!&quot;" />
                <ExamplePhrase text="say Если есть вопросы, задавайте." />
                <ExamplePhrase text="say Тогда,на этом лекция закончена." />
            </div>

            <div className="subsection">
                <h3>💬 Рация</h3>
                <ExamplePhrase text="say Здравствуйте, тема лекции &quot;Рация&quot;" />
                <ExamplePhrase text="say Рация - это источник связи для передачи важной информации" />
                <ExamplePhrase text="say В рации звучит такая информация, как доклады с патруля и тому подобное" />
                <ExamplePhrase text="say В рации запрещены всякие оскорбления, угрозы, провокации" />
                <ExamplePhrase text="say В рацию запрещено сообщать бессмысленную информацию" />
                <ExamplePhrase text="b Запросы по форме: /d [От-кого][К кому] Суть запроса" />
                <ExamplePhrase text="b Пример запроса: /d [МО][ГУВД-М] Требуется экипаж к КПП." />
                <ExamplePhrase text="b Перед тем как сделлать доклад в рацию нужно отыграть ее биндами" />
                <ExamplePhrase text="say За нарушение данных правил вы будете наказаны" />
                <ExamplePhrase text="say Благодарю за внимание, на этом наша лекция окончена" />
            </div>

            <div className="subsection">
                <h3>💬 Тен-коды</h3>
                <ExamplePhrase text="say Тема лекции &quot;Тен-коды&quot;." />
                <ExamplePhrase text="say Тен-кодами называют специальные сокращения, которые используют для ускорения передачи информации." />
                <ExamplePhrase text="say Тен-коды может использовать любой военнослужащий, если это не ограничено его полномочиями." />
                <ExamplePhrase text="b Соответствующий тэн-код необходимо писать в RP-рацию после тэга отдела." />
                <ExamplePhrase text="say Существуют следующие коды:" />
                <ExamplePhrase text="say Код-1 - Обстановка спокойная" />
                <ExamplePhrase text="say Код-2 - Общая боевая тревога в части!" />
                <ExamplePhrase text="say Код-3 - Требуется подмога!" />
                <ExamplePhrase text="say Код-4 - Заступил на службу." />
                <ExamplePhrase text="b Для контрактной службы во время захода в игру" />
                <ExamplePhrase text="say Код-5 - Окончил службу и сдал форму." />
                <ExamplePhrase text="b Для контрактной службы при выходе из игры" />
                <ExamplePhrase text="say Код-6 - Всеобщее построение на плацу!" />
                <ExamplePhrase text="say Код-7 - Проникновение на территорию Воинской Части!" />
                <ExamplePhrase text="say Код-8 - Цель ликвидирована!" />
                <ExamplePhrase text="say Код-9 - Покинул место несения службы." />
                <ExamplePhrase text="b Для контрактной службы при взятии перерыва/окончания РД" />
                <ExamplePhrase text="say Код-10 - Вернулся на место несения службы." />
                <ExamplePhrase text="b Для контрактной службы при окончания перерыва/начала РД" />
                <ExamplePhrase text="say Каждый военнослужащий должен знать их!" />
                <ExamplePhrase text="say Это очень важные коды которые используются для передачи быстрой информации" />
                <ExamplePhrase text="say Для быстрое восприятия информации." />
                <ExamplePhrase text="say На этом лекция &quot;Тен-коды&quot; закончена." />
            </div>

            <div className="subsection">
                <h3>💬 Халатность</h3>
                <ExamplePhrase text="say Сейчас будет прочтена лекция на тему &quot;Халатность&quot;." />
                <ExamplePhrase text="say Халатность понимается в административном законодательстве как неисполнение или..." />
                <ExamplePhrase text="say ...ненадлежащее исполнение должностным лицом своих обязанностей вследствие..." />
                <ExamplePhrase text="say ...недобросовестного или небрежного отношения к работе.." />
                <ExamplePhrase text="say Объект и субъект халатности, последствия в виде существенного нарушения прав..." />
                <ExamplePhrase text="say ...и законных интересов граждан, организаций, охраняемых законом интересов общества или государства..." />
                <ExamplePhrase text="say ...по своему содержанию ничем не отличаются от аналогичных понятий, используемых при характеристике других..." />
                <ExamplePhrase text="say ...преступлений против государственной власти, интересов государственной службы и..." />
                <ExamplePhrase text="say ...службы в органах местного самоуправления, и проанализированы выше." />
                <ExamplePhrase text="say Для привлечения к уголовной ответственности за халатность должно быть установлено:" />
                <ExamplePhrase text="say 1. какие конкретно обязанности были возложены в установленном порядке на данное должностное лицо;" />
                <ExamplePhrase text="say 2. что именно из этих обязанностей не выполнено или выполнено ненадлежаще;" />
                <ExamplePhrase text="say 3. повлекло ли это существенно вредные последствия для охраняемых законом прав..." />
                <ExamplePhrase text="say ...и интересов граждан либо государственных или общественных интересов;" />
                <ExamplePhrase text="say 4. имело ли данное должностное лицо реальную возможность для надлежащего исполнения..." />
                <ExamplePhrase text="say ...служебных обязанностей и недопущения вследствие этого существенно вредных последствий." />
                <ExamplePhrase text="say Другие виды халатного поведения наказываются..." />
                <ExamplePhrase text="say ...дисциплинарными взысканиями или увольнением с места работы." />
                <ExamplePhrase text="say Таким образом, халатность характеризуется:.." />
                <ExamplePhrase text="say Во-первых, бездействием должностного лица." />
                <ExamplePhrase text="say Во-вторых, наступлением последствий, указанных в законе." />
                <ExamplePhrase text="say В-третьих, причинной связью между ненадлежащим поведением по службе..." />
                <ExamplePhrase text="say ...должностного лица и наступившими последствиями." />
                <ExamplePhrase text="say На этом наша лекция окончена, спасибо за внимание!" />
            </div>

            <div className="subsection">
                <h3>💬 «Взрывчатые вещества - общее введение»</h3>
                <ExamplePhrase text="s Здравия желаю, бойцы. Сейчас будет проведена лекция «Взрывчатые вещества - общее введение»." />
                <ExamplePhrase text="s При устройстве окопов и укрытий в мерзлых и скальных грунтах…" />
                <ExamplePhrase text="s …а также при уничтожении и порче боевой техники противника, уничтожения своей техники…" />
                <ExamplePhrase text="s …которой угрожает захват противником применяют заряды взрывчатых веществ…" />
                <ExamplePhrase text="s …средства взрывания и заряды промышленного изготовления." />
                <ExamplePhrase text="s Для производства взрывных работ в войсках применяются взрывчатые вещества (ВВ) нормальной мощности – тротил" />
                <ExamplePhrase text="s Тротил. По внешнему виду тротил представляет собой светло-желтое вещество." />
                <ExamplePhrase text="s Тротил токсичен, предельно допустимая концентрация 0,001 мг/л, он поражает…" />
                <ExamplePhrase text="s …дыхательные пути пищеварительный тракт." />
                <ExamplePhrase text="s При длительном воздействии вызывает слабость, головокружение…" />
                <ExamplePhrase text="s …дерматиты кожи, гепатит и т.п." />
                <ExamplePhrase text="s Из 400 г и 200 г тротиловых шашек при взрывных работах составляются заряды…" />
                <ExamplePhrase text="s …необходимой массы (по расчету) и формы." />
                <ExamplePhrase text="s 75 г шашки применяются в основном для взрывных работ в мерзлых…" />
                <ExamplePhrase text="s …твердых грунтах и скальных породах на открытых разработках." />
                <ExamplePhrase text="s Лекция окончена. Спасибо за внимание!" />
            </div>

            <div className="subsection">
                <h3>💬 «Средства взрывания»</h3>
                <ExamplePhrase text="s Здравия желаю, бойцы. Сейчас будет проведена лекция «Средства взрывания»." />
                <ExamplePhrase text="s Взрыв зарядов ВВ производится, как правило, огневым или электрическим способом..." />
                <ExamplePhrase text="s …при этом может применяться также взрывание при помощи детонирующего шнура." />
                <ExamplePhrase text="s Огневой способ применяется для взрывания одиночных зарядов ВВ…" />
                <ExamplePhrase text="s …или для разновременного взрывания…" />
                <ExamplePhrase text="s …серий зарядов, когда взрыв одного из них не может повредить другого заряда или другой серии." />
                <ExamplePhrase text="s Капсюли-детонаторы применяются для инициирования (возбуждения детонации) зарядов ВВ." />
                <ExamplePhrase text="s Капсюли-детонаторы взрываются: от пучка искр огнепроводного…" />
                <ExamplePhrase text="s …от электровоспламенителя или от взрыва детонирующего шнура" />
                <ExamplePhrase text="s Капсюли-детонаторы требуют осторожного обращения…" />
                <ExamplePhrase text="s …так как от удара, трения и нагревания они могут взорваться." />
                <ExamplePhrase text="s Капсюли - детонаторы считаются негодными при:" />
                <ExamplePhrase text="s Наличии сквозных трещин и помятостей." />
                <ExamplePhrase text="s Скорость горения огнепроводного шнура на воздухе составляет приблизительно 1 см/с" />
                <ExamplePhrase text="s Под водой шнур горит на глубине до 5 м, горение его под водой протекает быстрее, чем на воздухе." />
                <ExamplePhrase text="s Лекция окончена. Спасибо за внимание!" />
            </div>

            <div className="subsection">
                <h3>💬 «Заряды»</h3>
                <ExamplePhrase text="s Здравия желаю, бойцы. Сейчас будет проведена лекция «Заряды»." />
                <ExamplePhrase text="s Изготовление зажигательных трубок производится в следующем порядке:" />
                <ExamplePhrase text="s Чистым острым ножом на деревянной подкладке отрезают…" />
                <ExamplePhrase text="s …под прямым углом кусок огнепроводного шнура" />
                <ExamplePhrase text="s Затем вынимают из коробки капсюль-детонатор и проверяют его пригодность путем осмотра." />
                <ExamplePhrase text="s Обрезанный под прямым углом конец огнепроводного шнура осторожно вводят…" />
                <ExamplePhrase text="s …в гильзу капсюля-детонатора до упора в чашечку." />
                <ExamplePhrase text="s Воспламенение зажигательных трубок производят: воспламенительным фитилем." />
                <ExamplePhrase text="s Зажигательные трубки, изготавливаемые в промышленности, имеют три срока замедления:" />
                <ExamplePhrase text="s 50 сек (ЗТП-50), 150 сек (ЗТП-150) и 300 сек (ЗТП-300)" />
                <ExamplePhrase text="s Зажигательные трубки заводского изготовления, будучи воспламененными на воздухе…" />
                <ExamplePhrase text="s …надежно горят и в воде на глубинах до 5 м." />
                <ExamplePhrase text="s Трубки с механическим воспламенителем допускают воспламенение их в воде." />
                <ExamplePhrase text="s К местам производства взрывных работ зажигательные трубки должны…" />
                <ExamplePhrase text="s …доставляться в заводской упаковке или в сумках взрывника." />
                <ExamplePhrase text="s Обращение с зажигательными трубками должно быть таким же осторожным…" />
                <ExamplePhrase text="s …как обращение с капсюлями-детонаторами" />
                <ExamplePhrase text="s Лекция окончена. Спасибо за внимание!" />
            </div>

            <div className="subsection">
                <h3>💬 Тактика</h3>
                <ExamplePhrase text="s Сейчас Я расскажу лекцию «Основы современного общевойскового боя – Тактика»" />
                <ExamplePhrase text="s Тактика изучает и разрабатывает способы подготовки и ведения общевойскового боя." />
                <ExamplePhrase text="s Она включает тактику общевойсковых соединений, частей и подразделений, а также…" />
                <ExamplePhrase text="s …видов вооруженных сил РФ и входящих в сухопутные войска родов войск и специальных войск." />
                <ExamplePhrase text="s Она изучает содержание видов боевых действий, роль ударов ядерными, огневыми и другими…" />
                <ExamplePhrase text="s …средствами поражения, разрабатывает формы маневра войск, походные, предбоевые и боевые порядки…" />
                <ExamplePhrase text="s …определяет место и роль соединений, частей и подразделений, каждого рода войск и специальных…" />
                <ExamplePhrase text="s …войск в общевойсковом бою, задачи, которые выполняют в ходе боевых действий…" />
                <ExamplePhrase text="s …способы их совместного боевого применения и порядок взаимодействия между ними." />
                <ExamplePhrase text="s Лекция Окончена! Благодарю за внимание!" />
            </div>

            <div className="subsection">
                <h3>💬 ГАЗ-3110</h3>
                <ExamplePhrase text="s Сейчас я прочту лекцию на тему легковой автомобиль ГАЗ-3110" />
                <ExamplePhrase text="s Сборка: ГАЗ (Нижний Новгород, Россия)" />
                <ExamplePhrase text="s Поговорим немного о технических характеристиках." />
                <ExamplePhrase text="s Кузов: седан." />
                <ExamplePhrase text="s Количество дверей/мест: 4/5." />
                <ExamplePhrase text="s Снаряженная масса: 1401 кг." />
                <ExamplePhrase text="s Размеры: длина — 4870 мм, ширина — 1800 мм, высота — 1422 мм." />
                <ExamplePhrase text="s Тип двигателя: бензиновый." />
                <ExamplePhrase text="s Привод: задний." />
                <ExamplePhrase text="s Двигатель: ЗМЗ-4062.10" />
                <ExamplePhrase text="s Мощность двигателей: Мощность: 90 л. с." />
                <ExamplePhrase text="s Максимальная скорость -  135  км/ч" />
                <ExamplePhrase text="s Время разгона с места до 100 км/ч: 23 с." />
                <ExamplePhrase text="s Максимальный крутящий момент: 172 Нм." />
                <ExamplePhrase text="s Трансмиссия: механика." />
                <ExamplePhrase text="s Ёмкость топливного бака: 55 л." />
                <ExamplePhrase text="s Расход топлива: городской цикл — 15,0 л, загородный цикл — 9,3 л, смешанный цикл — 13,1 л." />
                <ExamplePhrase text="s Основная задача это патрулирование территории и сдача экзаменнов для сотрудников ВП." />
                <ExamplePhrase text="s Лекция окончена. Спасибо за внимание!" />
            </div>

            <div className="subsection">
                <h3>💬 Lada 4x4 Urban</h3>
                <ExamplePhrase text="s Сейчас я прочту лекцию на тему внедорожного автомобиля Lada 4x4 Urban" />
                <ExamplePhrase text="s Сборка: АвтоВАЗ (Тольятти, Россия)" />
                <ExamplePhrase text="s Поговорим немного о технических характеристиках." />
                <ExamplePhrase text="s Тип кузова:  SUV, 5 дверей;" />
                <ExamplePhrase text="s Масса: 1425 кг" />
                <ExamplePhrase text="s Размеры: длина — 4240 мм, ширина — 1680 мм, высота — 1640 мм." />
                <ExamplePhrase text="s Тип двигателя: бензиновый." />
                <ExamplePhrase text="s Расход топлива: в городском цикле: 12,1 л/100 км; в загородном циклe: 8,3 л/100 км;" />
                <ExamplePhrase text="s в смешанном цикле: 9,7 л/100 км." />
                <ExamplePhrase text="s Привод: полный." />
                <ExamplePhrase text="s Двигатель: ВАЗ-2121" />
                <ExamplePhrase text="s Максимальная скорость -  137  км/ч" />
                <ExamplePhrase text="s Время разгона с места до 100 км/ч: 19 с." />
                <ExamplePhrase text="s Максимальный крутящий момент: 129 Нм." />
                <ExamplePhrase text="s Тип трансмиссии: 5 МКПП;" />
                <ExamplePhrase text="s Ёмкость топливного бака: 42 л." />
                <ExamplePhrase text="s Основная задача это патрулирование территории и сдача экзаменнов для сотрудников ВП." />
                <ExamplePhrase text="s Лекция окончена. Спасибо за внимание!" />
            </div>

            <div className="subsection">
                <h3>💬 Toyota Camry (XV55)</h3>
                <ExamplePhrase text="s Сейчас я прочту лекцию на тему легкового автомобиля Toyota Camry (XV55)" />
                <ExamplePhrase text="s Сборка: Япония, США, Австралия, Россия, Китай" />
                <ExamplePhrase text="s Поговорим немного о технических характеристиках." />
                <ExamplePhrase text="s Тип кузова:  4‑дв. седан (5‑мест.)" />
                <ExamplePhrase text="s Масса: 1530–1550 кг" />
                <ExamplePhrase text="s Размеры: длина — 4850 мм, ширина — 1825 мм, высота — 1480  мм." />
                <ExamplePhrase text="s Тип двигателя: бензин" />
                <ExamplePhrase text="s Расход топлива при городском цикле 11.  Расход топлива на трассе 5,9. Смешанный цикл 7,8" />
                <ExamplePhrase text="s Привод: Передний." />
                <ExamplePhrase text="s Двигатель: 2,5-литровый двигатель Dual VVT-i 6-ст. АКП" />
                <ExamplePhrase text="s Максимальная скорость -  220  км/ч" />
                <ExamplePhrase text="s Время разгона с места до 100 км/ч: 9 с." />
                <ExamplePhrase text="s Максимальный крутящий момент: 231 Нм." />
                <ExamplePhrase text="s Тип трансмиссии: Гидромеханическая." />
                <ExamplePhrase text="s Ёмкость топливного бака: 70 л." />
                <ExamplePhrase text="s Основная задача это патрулирование территории и сдача экзаменнов для сотрудников ВП." />
                <ExamplePhrase text="s Лекция окончена. Спасибо за внимание!" />
            </div>

            <div className="subsection">
                <h3>💬 KIA Optima SXL</h3>
                <ExamplePhrase text="s Сейчас я прочту лекцию на тему легкового автомобиля KIA Optima SXL" />
                <ExamplePhrase text="s Сборка: Южная Корея: Хвасон (Hwaseong Plant) Китай: Yancheng (завод в Яньчэне) Россия: Калининград (Автотор)" />
                <ExamplePhrase text="s Поговорим немного о технических характеристиках." />
                <ExamplePhrase text="s Тип кузова:  4‑дв. седан (5‑мест.)" />
                <ExamplePhrase text="s Масса: 1 460–1 525 кг" />
                <ExamplePhrase text="s Размеры: длина — 4850 мм, ширина — 1860 мм, высота — 1470  мм." />
                <ExamplePhrase text="s Тип двигателя: бензин" />
                <ExamplePhrase text="s Расход топлива при городском цикле 12.5.  Расход топлива на трассе 6,3." />
                <ExamplePhrase text="s Привод: Передний." />
                <ExamplePhrase text="s Двигатель: 2,4 л GDI" />
                <ExamplePhrase text="s Максимальная скорость -  205  км/ч" />
                <ExamplePhrase text="s Время разгона с места до 100 км/ч: 9.4 с." />
                <ExamplePhrase text="s Максимальный крутящий момент: 252 Нм." />
                <ExamplePhrase text="s Тип трансмиссии: 6-ступенчатая автоматическая коробка передач" />
                <ExamplePhrase text="s Ёмкость топливного бака: 70 л." />
                <ExamplePhrase text="s Основная задача это патрулирование территории и сдача экзаменнов для сотрудников ВП." />
                <ExamplePhrase text="s Лекция окончена. Спасибо за внимание!" />
            </div>

            <div className="subsection">
                <h3>💬 БТР-80</h3>
                <ExamplePhrase text="s Сейчас Я расскажу лекцию про ГАЗ-5903 - БТР-80" />
                <ExamplePhrase text="s БТР-80 — российский бронетранспортер" />
                <ExamplePhrase text="s БТР-80 производиться Арзамасским машиностроительным заводом с 1984 года." />
                <ExamplePhrase text="s Стоимость нового БТР разных модификаций составляет 50-90 млн. Рублей" />
                <ExamplePhrase text="s Вооружение состоит из крупнокалиберного КПВТ со спаренным ПКТ" />
                <ExamplePhrase text="s Технические характеристики БТР:" />
                <ExamplePhrase text="s Боевая масса: 13.6 тонн" />
                <ExamplePhrase text="s Двигатель КамАЗ 7403 и ЯМЗ-238М2 мощностью 260/240 л.с. соответственно" />
                <ExamplePhrase text="s Максимальная скорость грунт/асфальт: 50-80 Км/ч" />
                <ExamplePhrase text="s Максимальная скорость по воде: 9 Км/ч" />
                <ExamplePhrase text="s Длина: 7,6 м." />
                <ExamplePhrase text="s Ширина: 2,9 м." />
                <ExamplePhrase text="s Высота: 2,4 м." />
                <ExamplePhrase text="s Запас хода по шоссе: 600 км." />
                <ExamplePhrase text="s Запас хода по пересеченной местности: 200 км." />
                <ExamplePhrase text="s Лекция закончена! Спасибо за внимание!" />
            </div>

            <div className="subsection">
                <h3>💬 ГАЗ Тигр</h3>
                <ExamplePhrase text="s Сейчас Я расскажу лекцию про ГАЗ Тигр" />
                <ExamplePhrase text="s ГАЗ Тигр — бронеавтомобиль-внедорожник" />
                <ExamplePhrase text="s ГАЗ Тигр Производитель Россия Военно-промышленная компания с 2005 года." />
                <ExamplePhrase text="s Стоимость гражданского «Тигра» составляет 100 000 — 120 000 долларов США, в зависимости от модификации." />
                <ExamplePhrase text="s Главная вооружение 7,62-мм пулемет ПКП &quot;Печенег&quot; или Корд-12,7-мм крупнокалиберный пулемет" />
                <ExamplePhrase text="s Технические характеристики ГАЗ Тигр:" />
                <ExamplePhrase text="s Боевая масса: 7,2 тонн" />
                <ExamplePhrase text="s Двигатель: ЯМЗ-5347-10 4.43 Литровый 4-цилиндровый турбодизель мощностью" />
                <ExamplePhrase text="s 215 л.с. (158 кВт) Cummins 5,9 л (360 куб.)" />
                <ExamplePhrase text="s Максимальная скорость грунт/асфальт: 140 Км/ч" />
                <ExamplePhrase text="s Максимальная скорость 80 км / ч (50 миль / ч) по бездорожью" />
                <ExamplePhrase text="s Преодолеваемый брод, 1,2 м." />
                <ExamplePhrase text="s Длина: 5670 мм." />
                <ExamplePhrase text="s Ширина: 2200 мм." />
                <ExamplePhrase text="s Высота: 2000 мм." />
                <ExamplePhrase text="s Запас хода по шоссе: 600 км." />
                <ExamplePhrase text="s Запас хода по пересеченной местности: 200 км." />
                <ExamplePhrase text="s Лекция закончена! Спасибо за внимание!" />
            </div>

            <div className="subsection">
                <h3>💬 Вертолёт &quot;Maverick&quot;</h3>
                <ExamplePhrase text="s Сейчас я прочту лекцию на тему вертолёта &quot;Maverick&quot;." />
                <ExamplePhrase text="s Вертолёт Maverick сделан на основе Bell 206," />
                <ExamplePhrase text="s Это семейство лёгких многоцелевых вертолётов." />
                <ExamplePhrase text="s Поговорим немного о технических характеристиках." />
                <ExamplePhrase text="s Грузоподъёмность - 855 кг." />
                <ExamplePhrase text="s Длинна - 13,02 м." />
                <ExamplePhrase text="s Двигатель: 250-C30P" />
                <ExamplePhrase text="s Мощность двигателя,л.с. (кВт): 1× 726 (541)" />
                <ExamplePhrase text="s Двигатель производства Rolls-Royce." />
                <ExamplePhrase text="s Максимальная скорость - 213 км/ч." />
                <ExamplePhrase text="s Продолжительность полёта - 4 ч 30 м." />
                <ExamplePhrase text="s Скороподъёмность: 6,8 м/с" />
                <ExamplePhrase text="s Данный вертолёт не оснащён огневой мощью." />
                <ExamplePhrase text="s Основная задача это патруль территорий." />
                <ExamplePhrase text="s Так-же используется для тренировок и экзаменов у штурмовиков." />
                <ExamplePhrase text="s Лекция окончена. Спасибо за внимание!" />
            </div>

            <div className="subsection">
                <h3>💬 МИ-8</h3>
                <ExamplePhrase text="s Сейчас я прочту лекцию на тему вертолёта Ми-8Ш" />
                <ExamplePhrase text="s Вертолёт Ми-8Ш сделан на основе Ми-8" />
                <ExamplePhrase text="s Это семейство советских многоцелевых вертолётов." />
                <ExamplePhrase text="s Поговорим немного о технических характеристиках." />
                <ExamplePhrase text="s Грузоподъёмность - 3100 кг." />
                <ExamplePhrase text="s Длинна – 25,2 м." />
                <ExamplePhrase text="s Двигатель производства ТВ2-117." />
                <ExamplePhrase text="s Максимальная скорость - 250 км/ч." />
                <ExamplePhrase text="s Дальность полёта - 800 км с доп. баками." />
                <ExamplePhrase text="s Данный вертолёт не оснащён огневой мощью." />
                <ExamplePhrase text="s Основная задача это поставка грузов." />
                <ExamplePhrase text="s Так-же используется для тренировок и экзаменов." />
                <ExamplePhrase text="s Лекция окончена. Спасибо за внимание!" />
            </div>

            <div className="subsection">
                <h3>💬 &quot;Первая помощь при огнестрельном ранении&quot;</h3>
                <ExamplePhrase text="s Сейчас я прочту лекцию на тему &quot;Первая помощь при огнестрельном ранении&quot;" />
                <ExamplePhrase text="s Пуля, проникая в тело, наносит ему довольно сильные повреждения." />
                <ExamplePhrase text="s Во-первых, раны обычно глубокие, а ранящий предмет часто остается внутри тела." />
                <ExamplePhrase text="s Во-вторых, рана часто загрязнена фрагментами тканей, снаряда и осколками костей." />
                <ExamplePhrase text="s Эти особенности огнестрельного ранения стоит учитывать при оказании рострадавшему первой помощи." />
                <ExamplePhrase text="s В первую очередь нужно вызвать медсанбат (медиков)." />
                <ExamplePhrase text="s После этого необходимо остановить кровотечение. При несильном кровотечении - повязкой, при обильном - жгутом выше раны." />
                <ExamplePhrase text="s При ранении в голову рану не трогаем!" />
                <ExamplePhrase text="s Eсли наложить жгут не возможно, то возможен вариант затыкания раны…" />
                <ExamplePhrase text="s …толстым куском ваты во всю глубину ранения во всех случаях ранения." />
                <ExamplePhrase text="s Раненому обязательно дать обезболивающее чтобы исключить смерть от болевого шока." />
                <ExamplePhrase text="s В случае ранения в грудную клетку пострадавшему следует придать сидячее положение, в других случаях лежачее." />
                <ExamplePhrase text="s Минимизировать количество передвижений раненого, так как ему нужен покой." />
                <ExamplePhrase text="s На этом лекция окончена. Спасибо за внимание!" />
            </div>

            <div className="subsection">
                <h3>💬 &quot;Первая помощь при колющем ранении&quot;</h3>
                <ExamplePhrase text="s Сейчас я прочту лекцию на тему &quot;Первая помощь при колющем ранении&quot;" />
                <ExamplePhrase text="s Штык-нож, проникая в тело, наносит ему довольно сильные, зачастую рваные повреждения." />
                <ExamplePhrase text="s Во-первых, раны обычно глубокие, а ранящий предмет часто остается вне тела." />
                <ExamplePhrase text="s Во-вторых, рана часто загрязнена фрагментами тканей, грязью и ржавчиной с ножа." />
                <ExamplePhrase text="s Эти особенности колющего ранения стоит учитывать при оказании пострадавшему первой помощи." />
                <ExamplePhrase text="s В первую очередь нужно вызвать медсанбат (медиков)." />
                <ExamplePhrase text="s После этого необходимо остановить кровотечение. При несильном кровотечении - повязкой, при обильном - жгутом выше раны." />
                <ExamplePhrase text="s При сильном ранении в шею накладывается жгут по специальной методике…" />
                <ExamplePhrase text="s …если наложить жгут не возможно, то возможен вариант затыкания раны…" />
                <ExamplePhrase text="s …толстым куском ваты во всю глубину ранения во всех случаях ранения." />
                <ExamplePhrase text="s Раненому обязательно дать обезболивающее чтобы исключить смерть от болевого шока." />
                <ExamplePhrase text="s В случае ранения в грудную клетку пострадавшему следует придать сидячее положение, в других случаях лежачее." />
                <ExamplePhrase text="s Минимизировать количество передвижений раненого, так как ему нужен покой." />
                <ExamplePhrase text="s На этом лекция окончена. Спасибо за внимание!" />
            </div>

            <div className="subsection">
                <h3>💬 &quot;Сердечно-легочная реанимация (СЛР)&quot;</h3>
                <ExamplePhrase text="s Сейчас я прочту лекцию на тему &quot;Сердечно-легочная реанимация (СЛР)&quot;" />
                <ExamplePhrase text="s Прекращение сердечной деятельности именуемое Асистолия." />
                <ExamplePhrase text="s Нечто иное как остановка сердца." />
                <ExamplePhrase text="s С данного момента счет идет на минуты." />
                <ExamplePhrase text="s В первую очередь нужно вызвать медсанбат (медиков), проверить наличие сознания и дыхания." />
                <ExamplePhrase text="s При остановке сердца необходимо провести Сердечно-лёгочную реанимацию (СЛР)." />
                <ExamplePhrase text="s Проводится она путем надавливания ладонями на два пальца выше солнечного сплетения…" />
                <ExamplePhrase text="s … с периодическим проведением искусственного дыхания в пропорциях 30/2 соответственно." />
                <ExamplePhrase text="s Так же перед проведением СЛР при наличии необходимо дать пострадавшему:" />
                <ExamplePhrase text="s Адреналин для сужения сосудов и повышения давления." />
                <ExamplePhrase text="s Атропин для увеличения частоты разрядов синусового узла." />
                <ExamplePhrase text="s При соблюдении данных условий Ваш товарищ останется жив." />
                <ExamplePhrase text="s После проведения СЛР пострадавшему нужен покой." />
                <ExamplePhrase text="s На этом лекция окончена. Спасибо за внимание!" />
            </div>

            <div className="subsection">
                <h3>💬 Сон</h3>
                <ExamplePhrase text="say Здравствуйте, тема лекции &quot;Сон&quot;" />
                <ExamplePhrase text="say Сон - это процесс, благодаря которому наш организм отдыхает и набирается сил" />
                <ExamplePhrase text="say Помимо физического и психологического отдыха сон..." />
                <ExamplePhrase text="say ...благоприятно воздействует и на здоровье,.." />
                <ExamplePhrase text="say ...так как при болезнях именно во сне организм лучше всего борется с..." />
                <ExamplePhrase text="say ...различными вирусными и инфекционными недугами" />
                <ExamplePhrase text="say Установлено, что если человек проведёт более двух суток без сна,.." />
                <ExamplePhrase text="say ...то у него начнёт резко ухудшаться самочувствие,..." />
                <ExamplePhrase text="say ...будет наблюдаться падение физической активности,.." />
                <ExamplePhrase text="say ...а так же это приведёт к появлению галлюцинаций и к психическим расстройствам" />
                <ExamplePhrase text="say Первое с чего необходимо начать - это режим дня" />
                <ExamplePhrase text="say Заставьте себя ложиться в одно и то же время" />
                <ExamplePhrase text="say Медики рекомендуют ложиться спать до полуночи, самое благоприятное время..." />
                <ExamplePhrase text="say для начала сна это 11 часов ночи" />
                <ExamplePhrase text="say Для того чтобы выспаться человеку необходимо 6-8 часов сна" />
                <ExamplePhrase text="say Для полного восстановления сил рекомендуется спать не менее 8-ми часов в сутки" />
                <ExamplePhrase text="say Для здорового и крепкого сна у вас должна быть удобная кровать" />
                <ExamplePhrase text="say Перед сном, минимум за 2 часа до его начала, не употребляйте..." />
                <ExamplePhrase text="say тяжёлую пищу и не пейте много воды." />
                <ExamplePhrase text="say Старайтесь перед сном не читать и не смотреть телевизор" />
                <ExamplePhrase text="say Лучше послушайте спокойную и расслабляющую музыку, которая будет способствовать сну" />
                <ExamplePhrase text="say Перед сном рекомендуется принять ванну или душ, которые отлично расслабляют" />
                <ExamplePhrase text="say Старайтесь подумать о хорошем, подумать о планах на завтра с таким настроем, что всё получится!" />
                <ExamplePhrase text="say Если вам предстоит выступление либо отчет на работе, настройте свои мысли, что вы молодец,.." />
                <ExamplePhrase text="say чтобы все планы у вас сбывались, а настроение с утра было отличным." />
                <ExamplePhrase text="say Благодарю за внимание, на этом наша лекция окончена." />
            </div>

            <div className="subsection">
                <h3>💬 Курение</h3>
                <ExamplePhrase text="say Здравствуйте, тема лекции &quot;Курение&quot;" />
                <ExamplePhrase text="say Табачный дым состоит из 4000 компонентов. Самые известные из них никотин и смолы." />
                <ExamplePhrase text="say Но и другие составляющие не менее опасны: яды, радиоактивные вещества, тяжелые металлы." />
                <ExamplePhrase text="say Не стоит надеяться, что вас защитит сигаретный фильтр." />
                <ExamplePhrase text="say Даже самые современные из них улавливают только 20 процентов веществ содержащихся в дыме." />
                <ExamplePhrase text="say Каждые 10 секунд на земле умирает 1 курильщик." />
                <ExamplePhrase text="say Когда вы затягиваетесь, то температура на кончике сигареты достигает 800 градусов." />
                <ExamplePhrase text="say При таких условиях происходит сухая перегонка табака." />
                <ExamplePhrase text="say Это означает, что вдыхаемый воздух, проходя сквозь слой нагретого табака,.." />
                <ExamplePhrase text="say ...несет с собой летучие вещества и мельчайшие твердые частички." />
                <ExamplePhrase text="say Они с потоком воздуха проникают в рот, трахею бронхи и попадают в альвеолы легких." />
                <ExamplePhrase text="say Благодарю за внимание, на этом наша лекция окончена" />
            </div>

            <div className="subsection">
                <h3>💬 Вред наркотических средств</h3>
                <ExamplePhrase text="say Здравствуйте, тема лекции &quot;Вред наркотических средств&quot;" />
                <ExamplePhrase text="say Сейчас я проведу лекцию о вреде наркотических средств" />
                <ExamplePhrase text="say Думаю каждый из вас знает, что наркотические средства очень вредны для организма" />
                <ExamplePhrase text="say Дыхание - одно из самых важных факторов в жизни, однако,.." />
                <ExamplePhrase text="say ...наркоман уже никогда не сможет дышать досыта" />
                <ExamplePhrase text="say Наркоманы обрекают себя на пожизненное кислородное голодание" />
                <ExamplePhrase text="say Также, наркотические средства постепенно уничтожают клетки мозга, функции всех клеток слабеют" />
                <ExamplePhrase text="say И уже человеку с зависимостью становиться все сложнее обдумывать даже простые вещи" />
                <ExamplePhrase text="say Он постепенно превращается в так называемый &quot;овощ&quot;." />
                <ExamplePhrase text="say Галлюцинации - также частое явление при употреблении наркотических средств" />
                <ExamplePhrase text="say И бывает, что человеку очень сложно совладеть ими, и из-за этого он делает ужасные вещи" />
                <ExamplePhrase text="say Благодарю за внимание, на этом наша лекция окончена!" />
            </div>

            <div className="subsection">
                <h3>💬 Алкоголизм</h3>
                <ExamplePhrase text="say Здравствуйте, тема лекции &quot;Алкоголизм&quot;" />
                <ExamplePhrase text="say Алкоголизм - серьезное заболевание, проявляющееся желанием употребить алкоголь." />
                <ExamplePhrase text="say Как действует алкоголь на организм?" />
                <ExamplePhrase text="say Речевая - нарушается речь, тоесть проявляется пьяная дикция." />
                <ExamplePhrase text="say Слуховая - плохо слышит, тоесть пьяному вопрос нужно повторять несколько раз." />
                <ExamplePhrase text="say Двигательная функция - нарушается походка..." />
                <ExamplePhrase text="say ...координация, видна пьяная, шатающаяся походка, заплетающиеся ноги." />
                <ExamplePhrase text="say Эмоции - на первый план выступает раздражительность и вспыльчивость..." />
                <ExamplePhrase text="say Тоесть  пьяный человек заводятся с полу-оборота." />
                <ExamplePhrase text="say Все эти нарушения происходят, так как мозговые клетки отравляются алкоголем - спиртом." />
                <ExamplePhrase text="say Мозг алкоголика дает необратимый сбой и никогда не станет работать нормально." />
                <ExamplePhrase text="say В мире еще не было и нет человека, кто бы решил свою проблему алкоголем!" />
                <ExamplePhrase text="say Благодарю за внимание, на этом наша лекция окончена." />
            </div>

            <div className="subsection">
                <h3>💬 Техника стрельбы из пистолета</h3>
                <ExamplePhrase text="s Cейчас я прочту лекцию &quot;Техника стрельбы из пистолета&quot;" />
                <ExamplePhrase text="s Выстрелом называется выбрасывание снаряда из канала ствола оружия под воздействием сильно нагретых упругих пороховых газов." />
                <ExamplePhrase text="s Прицельным выстрелом называется выбрасывание снаряда в строго определенном направлении, для поражения цели." />
                <ExamplePhrase text="s Изготовка - поза, принимаемая стрелком для ведения огня." />
                <ExamplePhrase text="s Применяемая мной в настоящее время поза изготовки к стрельбе из пистолета считается наиболее рациональной." />
                <ExamplePhrase text="s Хватка - положение рукоятки пистолета в кисти руки." />
                <ExamplePhrase text="s Рукоятка пистолета помещается в вилке, образуемой большим и указательным пальцами." />
                <ExamplePhrase text="s Прицеливание - наведение оружия в цель. Необходимо установить на одной линии целик, мушку и точку прицеливания." />
                <ExamplePhrase text="s Выжим спуска, завершая работу над выстрелом, по праву считается наиболее ответственным участком работы стрелка." />
                <ExamplePhrase text="s Спусковой крючок необходимо нажимать плавно,первой фалангой указательного пальца." />
                <ExamplePhrase text="s При выполнении прицельного выстрела дыхание необходимо затаивать." />
                <ExamplePhrase text="s На этом я завершаю лекцию. Спасибо за внимание." />
            </div>

            <div className="subsection">
                <h3>💬 Штык-нож 6х4</h3>
                <ExamplePhrase text="s Сейчас я прочту вам лекцию про Штык-нож 6х4." />
                <ExamplePhrase text="s Изделие 6х4 – общевойсковой штык-нож советско-российсой армии." />
                <ExamplePhrase text="s Является оружием ближнего боя." />
                <ExamplePhrase text="s Его основное применение обуславливается отсутствием возможности произведения…" />
                <ExamplePhrase text="s … мероприятий по обезвреживанию угрозы с вражеской стороны, а так же…" />
                <ExamplePhrase text="s … для перекуски проволоки-заграждений." />
                <ExamplePhrase text="s Особо креативные используют его в качестве мультитула…" />
                <ExamplePhrase text="s … вскрыть банку консерв, рубка деревьев и т.п. становится возможным…" />
                <ExamplePhrase text="s … благодаря особенности строения и сплава" />
                <ExamplePhrase text="s Длина - 270 мм." />
                <ExamplePhrase text="s Сплав – оружейная сталь" />
                <ExamplePhrase text="s На этом лекция окончена." />
            </div>

            <div className="subsection">
                <h3>💬 АК-47</h3>
                <ExamplePhrase text="s Сейчас будет зачитана лекция на тему «АК-47»." />
                <ExamplePhrase text="s Начнём с небольшого ознакомления с ним." />
                <ExamplePhrase text="s Сейчас у меня в руках Вы видите АК-47. АК расшифровывается как Автомат Калашникова." />
                <ExamplePhrase text="s Приставка 47 в данном случае означает, что на разработан он в 1947 году." />
                <ExamplePhrase text="s Хоть и поступил на вооружение он только в 1949 году." />
                <ExamplePhrase text="s Калибр у данного оружия – 7,62 мм." />
                <ExamplePhrase text="s Сосредоточенная дальность выстрела АК-47 составляет:" />
                <ExamplePhrase text="s По наземным целям — до 800 метров." />
                <ExamplePhrase text="s По воздушным целям — до 500 метров." />
                <ExamplePhrase text="s Дальность прямого выстрела:" />
                <ExamplePhrase text="s По грудной фигуре — 350 метров." />
                <ExamplePhrase text="s По ростовой фигуре — 525 метров." />
                <ExamplePhrase text="s Есть несколько модернизаций у АК-47." />
                <ExamplePhrase text="s АКС-47, АК-47Н, АКС-47Н, АК-47М." />
                <ExamplePhrase text="s С - со складным прикладом, Н - с ночным видением, М - модернизированный." />
                <ExamplePhrase text="s Общее ознакомление закончим на этом." />
                <ExamplePhrase text="s Лекция окончена. Спасибо за внимание!" />
            </div>
            <div className="subsection">
                <h3>📂 Материалы для лекций</h3>
                <p>Файл с лекциями: <a href="https://docs.google.com/document/d/11SDBGIy4Jn66JpitEV0-D2-uBdqRIopJe3IuaeAHmr8/edit?tab=t.0" className="document-link" target="_blank" rel="noopener noreferrer">Открыть документ</a></p>
            </div>

            <div className="note">
                <strong>📌 Примечание:</strong> Убедитесь, что у вас есть доступ к документу с лекциями перед началом занятий.
            </div>
        </>
    );
};

export default LecturesSection;