import React from 'react';
import DropdownMenu from "@/app/components/Manual/DropdownMenu";

const RPTaskSection = () => {
    const RpTaskVP = [
        "Замена колеса",
        "Замена ремня ГРМ",
        "Замена Масла",
    ];
    const RpTaskVPIcon = {
        "Замена колеса":"💪",
        "Замена ремня ГРМ":"🦵",
        "Замена Масла":"🏃‍♂️",
    };
    const RpTaskVPContent = {
        "Замена колеса": [
            "me открыл багажник",
            "do В багажнике лежит ящик с инструментами.",
            "me взял ящик с инструментами",
            "do Ящик с инструментами в правой руке.",
            "me положил ящик на землю",
            "do Домкрат в багажнике.",
            "me взял домкрат",
            "me положил домкрат на землю",
            "me поднимает машину домкратом",
            "do Машина поднята на домкрат.",
            "me открыл ящик с инструментами",
            "me взял ключ на 13",
            "me открутил болты",
            "me снимает колесо",
            "do Колесо снято.",
            "me взял колесо в руки",
            "me положил колесо на землю",
            "do Колесо на земле.",
            "do В багажнике запасное колесо.",
            "me взял запасное колесо",
            "me поставил колесо на место",
            "me закручивает болты",
            "do Болты закручены.",
            "me опускает машину домкратом",
            "me взял ящик с инструментами",
            "me положил ящик в багажник",
            "me взял домкрат в руки",
            "me положил домкрат в багажник и закрыла его"
        ],
        "Замена ремня ГРМ": [
            "do В бардачке лежит отвертка.",
            "me открыв бардачок, взял отвертку",
            "me открыл капот",
            "me снимает ремень ГРМ",
            "me снял ремень ГРМ",
            "do Ремень ГРМ в руках.",
            "do В багажнике лежит новый ремень ГРМ.",
            "me открыл багажник",
            "me положил старый ремень ГРМ в багажник",
            "me взял новый ремень ГРМ",
            "me поставил новый ремень ГРМ",
            "me проверил натяжение",
            "me закрыл капот"
        ],
        "Замена Масла": [
            "do Отвертка в руках.",
            "me залезла под машину",
            "me откручивает сливную гайку",
            "me открыла гайку",
            "do Масло вытекло.",
            "me закрутила гайку",
            "me открыла капот",
            "me открыла крышку с надписью \"Oil\"",
            "do В багажнике лежит канистра с новым маслом.",
            "me взяла новое масло",
            "me открыла масло",
            "me залила масло в автомобиль",
            "me проверила уровень масла",
            "me закрыла крышку с надписью \"Oil\"",
            "me закрыла капот"
        ]
    };
    const RpTaskVVS = [
        "Осмотр вертолёта",
        "Тех. задание",
        "Ремонт техники",
    ];
    const RpTaskVVSIcon = {
        "Осмотр вертолёта":"🚁",
        "Тех. задание":"📃",
        "Ремонт техники":"🔧",
    };
    const RpTaskVVSContent = {
        "Осмотр вертолёта": [
            "do Дверь закрыта.",
            "me открыла дверь",
            "me проверила состояние стекол на предмет отсутствия трещин",
            "do Трещины отсутствуют.",
            "me проверила каркас фонаря кабины экипажа на предмет отсутствия трещин",
            "do Трещины отсутствуют.",
            "me проверила внешнее состояние обшивки частей фюзеляжа на наличие трещин",
            "do Трещины и пробоины отсутствуют, заклепки закреплены.",
            "me проверила состояние амортизаторов",
            "do Амортизаторы в порядке.",
            "me проверила состояние подкосов",
            "do Подкосы в порядке.",
            "me проверила состояние колес и узлов",
            "do Колеса и узлы в порядке.",
            "me произвела осмотр промежуточного и хвостового редукторов",
            "do Редукторы в порядке.",
            "me проверила рулевой винт на исправность контровки разъемных соединений",
            "do Рулевой винт в порядке.",
            "me проверила уровень масла в осевых шарнирах",
            "do Уровень масла в норме.",
            "me открыла дверь",
            "me проверила сиденья и механизмы фиксации",
            "do Сиденья и механизмы фиксации в порядке.",
            "me проверила замки двери и блистеров",
            "do Замки двери и блистеров исправны.",
            "me закрыла дверь"
        ],
        "Тех. задание": [
            "me получил задание на ремонт",
            "do Техзадание получено.",
            "me проверил комплект инструментов",
            "do Инструменты: динамометрические ключи, торцевые головки, отвертки - полный комплект.",
            "me одел защитную экипировку",
            "do Надет: защитный комбинезон, перчатки, каска, защитные очки.",
            "me начал внешний осмотр воздушного судна",
            "me проверил состояние обшивки",
            "do Целостность фюзеляжа не нарушена.",
        ],
        "Ремонт техники": [
        "me подключил диагностический сканер",
        "do Сканер подключен, идет диагностика.",
        "me проверил показания давления",
        "do Давление в магистрали: в норме.",
        "do Обнаружена течь в соединении гидролинии №4.",
        "me заменил уплотнительные кольца",
        "do Уплотнители заменены на новые.",
        "me провел опрессовку системы",
        "do Давление  в системе нормальное.",
        "me снял панель доступа к электрощиту",
        "do Панель снята, доступ к блоку предохранителей открыт.",
        "me проверил состояние проводки",
        "do Обнаружено оплавление изоляции на кабеле.",
        "me заменил поврежденный участок кабеля",
        "do Установлен новый кабель на данном участке.",
        "me открыл капоты двигателя",
        "do Доступ к двигателю открыт.",
        "me проверил состояние лопаток вентилятора",
        "do Следов эрозии и повреждений нет.",
        "me осмотрел маслосистему",
        "do Уровень масла в норме, следов течи нет.",
        "me провел контрольный обход",
        "do Все сервисные люки закрыты, инструмент убран.",
        "me приступил к уборки  ангара после осмотра",
        "do Помещение ангара убрано, инструмент сдан на склад."
        ]
    };
    return (
        <>
            <div className="subsection">
                <h3>🏟️ Места проведения РП задания</h3>
                <p>РП задания проводятся у ангара:</p>
            </div>
            <div className="subsection">
                <h3>📚 РП задания для Военной Полиции (ВП)</h3>

                <div className="space-y-3 mt-4">
                    {RpTaskVP.map((training) => (
                        <DropdownMenu
                            title={training}
                            icon={RpTaskVPIcon[training as keyof typeof RpTaskVPContent] || "📖"}
                            items={RpTaskVPContent[training as keyof typeof RpTaskVPContent] || ["Содержание будет добавлено позже"]}
                        />
                    ))}
                </div>
            </div>
            <div className="subsection">
                <h3>📚 РП задания для Военно Воздушных Сил (ВВС)</h3>

                <div className="space-y-3 mt-4">
                    {RpTaskVVS.map((training) => (
                        <DropdownMenu
                            title={training}
                            icon={RpTaskVVSIcon[training as keyof typeof RpTaskVVSContent] || "📖"}
                            items={RpTaskVVSContent[training as keyof typeof RpTaskVVSContent] || ["Содержание будет добавлено позже"]}
                        />
                    ))}
                </div>
            </div>
        </>
    );        
            
};

export default RPTaskSection;