import React from 'react';
import DropdownMenu from '../DropdownMenu';

const TrainingSection = () => {
    const trainings = [
        "Тренировка 1: Отжимание",
        "Тренировка 2: Приседания",
        "Тренировка 3: Челночный бег",
        "Тренировка 4: Планка",
        "Тренировка 5: Бег",
        "Тренировка 6: Берпи",
        "Тренировка 7: Вис на перекладине",
        "Тренировка 8: Гусь",
        "Тренировка 9: Гимнастика",
        "Тренировка 10: Восстановление",
        "Тренировка 11: Прыжки в высоту",
        "Тренировка 12: Прыжки в длину",
        "Тренировка 13: Полоса препятствий",
    ];
    const trainingIcon = {
        "Тренировка 1: Отжимание":"💪",
        "Тренировка 2: Приседания":"🦵",
        "Тренировка 3: Челночный бег":"🏃‍♂️",
        "Тренировка 4: Планка":"🤸‍♀️",
        "Тренировка 5: Бег":"🏃",
        "Тренировка 6: Берпи":"🤾‍♂️",
        "Тренировка 7: Вис на перекладине":"🤸‍♂️",
        "Тренировка 8: Гусь":"🦆",
        "Тренировка 9: Гимнастика":"🤸",
        "Тренировка 10: Восстановление":"🧘",
        "Тренировка 11: Прыжки в высоту":"⬆️",
        "Тренировка 12: Прыжки в длину":"➡️",
        "Тренировка 13: Полоса препятствий":"🚧",
    }
    const trainingContent = {
        "Тренировка 1: Отжимание": [
            "say Сейчас пройдет тренировка \"Отжимания\"!",
            "say Упор лежа принять!",
            "say 30 раз под свой счет.",
            "s Начали!",
            "s Закончили!",
            "say Тренировка \"Отжимания\" закончена!",
        ],
        "Тренировка 2: Приседания": [
            "say Сейчас пройдет тренировка \"Приседания\"!.",
            "say 30 раз под свой счет.",
            "s Начали!",
            "s Закончили!",
            "say Тренировка \"Приседания\" закончена!",
        ],
        "Тренировка 3: Челночный бег": [
            "say Сейчас пройдет тренировка \"Челночный бег\"!",
            "say бежим 3 раза!",
            "s Начали!.",
            "s Закончили!",
            "say Тренировка \"Челночный бег\" закончена!",
        ],
        "Тренировка 4: Планка": [
            "say Сейчас пройдет тренировка \"Планка\"!",
            "say Упор лежа принять!",
            "say 30 секунд.",
            "say Начали!",
            "say Закончили!",
            "say Тренировка \"Планка\" закончена!",
        ],
        "Тренировка 5: Бег": [
                "say Сейчас пройдет тренировка \"Бег\"!",
                "say Строй на дороге!",
                "say Бежим от меня до конца полосы препятствий.",
                "say На старт!",
                "say Внимание!",
                "say Марш!",
                "say Тренировка \"Бег\" закончена!"
        ],
        "Тренировка 6: Берпи": [
            "say Сейчас пройдет тренировка \"Берпи\"!",
            "say Кругом!",
            "say Упор лежа принять!",
            "say 8 раз, начали!",
            "say Закончили!",
            "say Тренировка \"Берпи\" закончена!"
        ],
        "Тренировка 7: Вис на перекладине": [
            "say Сейчас пройдет тренировка \"Вис на перекладине\"!",
            "say Висим 1 минуту!",
            "say Начали!",
            "say Закончили!",
            "say Тренировка \"Вис на перекладине\" закончена!"
        ],
        "Тренировка 8: Гусь": [
            "say Сейчас пройдет тренировка \"Гусь\"!",
            "say 3 раза, Начали!",
            "say Закончили!",
            "say Тренировка \"Гусь\" закончена!"
        ],
        "Тренировка 9: Гимнастика": [
            "say Сейчас пройдет тренировка \"Гимнастика\"!",
            "b button F1 > Действия > Гимнастика",
            "say Делаем 1 минуту!",
            "say Закончили!",
            "say Тренировка \"Гимнастика\" закончена!"
        ],
        "Тренировка 10: Восстановление": [
            "say Сейчас пройдет тренировка \"Восстановление\"!",
            "b button F1 > Действия > Тай чи",
            "say Делаем 1 минуту, Начали!",
            "say Закончили!",
            "say Тренировка \"Восстановление\" закончена!"
        ],
        "Тренировка 11: Прыжки в высоту": [
            "say Сейчас пройдет тренировка \"Прыжки в высоту\"!",
            "say Лицом к стене становись!",
            "say 30 раз под свой счет",
            "say Начали!",
            "say Закончили!",
            "say Тренировка \"Прыжки в высоту\" закончена!"
        ],
        "Тренировка 12: Прыжки в длину": [
            "say Сейчас пройдет тренировка \"Прыжки в длину\"!",
            "say От забора до Ген.Штаба",
            "say Начали!",
            "say Закончили!",
            "say Тренировка \"Прыжки в длину\" закончена!"
        ],
        "Тренировка 13: Полоса препятствий": [
            "say Сейчас пройдет тренировка \"Полоса препятствий\"!",
            "say На позиции!",
            "say По выстрелу начинаем.",
            "*выстрел*",
            "say Тренировка \"Полоса препятствий\" закончена!"
        ]
    };
    return (
        <>
            <div className="subsection">
                <h3>🏟️ Места проведения тренировок</h3>
                <p>Все тренировки в основном проходят на территории воинской части:</p>
            </div>
            <div className="subsection">
                <h3>📚 Доступные тренеровки</h3>

                <div className="space-y-3 mt-4">
                    {trainings.map((training) => (
                        <DropdownMenu
                            title={training}
                            icon={trainingIcon[training as keyof typeof trainingContent] || "📖"}
                            items={trainingContent[training as keyof typeof trainingContent] || ["Содержание лекции будет добавлено позже"]}
                        />
                    ))}
                </div>
            </div>
            <div className="subsection">
                <h3>📂 Материалы для тренировок</h3>
                <p>Файл с тренировками: <a
                    href="https://docs.google.com/document/d/1RZ9_iGUavo-IC1WNr-APZVf8VRrrG7sI-wT5xzEKbps/edit?tab=t.0"
                    className="document-link" target="_blank" rel="noopener noreferrer">Открыть документ</a></p>
            </div>
        </>
    );
};

export default TrainingSection;