import React from 'react';
import DropdownMenu from "@/app/components/Manual/DropdownMenu";

const RPTaskSection = () => {
    const RpTaskVP = [
        "Замена колеса",
        "Замена ремня ГРМ",
        "Замена Масла",
    ];
    const RpTaskVPIcon = {
        "Замена колеса":"🛞",
        "Замена ремня ГРМ":"🛠️",
        "Замена Масла":"🩸️",
    };
    const RpTaskVPContent = {
        "Замена колеса": [
            "me открыл багажник",
            "do В багажнике лежит ящик с инструментами.",
            "me взял ящик с инструментами",
            "do Ящик с инструментами в правой руке.",
            "me положил ящик на землю",
            "do Домкрат в багажнике.",
            "me взял домкрат",
            "me положил домкрат на землю",
            "me поднимает машину домкратом",
            "do Машина поднята на домкрат.",
            "me открыл ящик с инструментами",
            "me взял ключ на 13",
            "me открутил болты",
            "me снимает колесо",
            "do Колесо снято.",
            "me взял колесо в руки",
            "me положил колесо на землю",
            "do Колесо на земле.",
            "do В багажнике запасное колесо.",
            "me взял запасное колесо",
            "me поставил колесо на место",
            "me закручивает болты",
            "do Болты закручены.",
            "me опускает машину домкратом",
            "me взял ящик с инструментами",
            "me положил ящик в багажник",
            "me взял домкрат в руки",
            "me положил домкрат в багажник и закрыла его"
        ],
        "Замена ремня ГРМ": [
            "do В бардачке лежит отвертка.",
            "me открыв бардачок, взял отвертку",
            "me открыл капот",
            "me снимает ремень ГРМ",
            "me снял ремень ГРМ",
            "do Ремень ГРМ в руках.",
            "do В багажнике лежит новый ремень ГРМ.",
            "me открыл багажник",
            "me положил старый ремень ГРМ в багажник",
            "me взял новый ремень ГРМ",
            "me поставил новый ремень ГРМ",
            "me проверил натяжение",
            "me закрыл капот"
        ],
        "Замена Масла": [
            "do Отвертка в руках.",
            "me залезла под машину",
            "me откручивает сливную гайку",
            "me открыла гайку",
            "do Масло вытекло.",
            "me закрутила гайку",
            "me открыла капот",
            "me открыла крышку с надписью \"Oil\"",
            "do В багажнике лежит канистра с новым маслом.",
            "me взяла новое масло",
            "me открыла масло",
            "me залила масло в автомобиль",
            "me проверила уровень масла",
            "me закрыла крышку с надписью \"Oil\"",
            "me закрыла капот"
        ]
    };
    const RpTaskVVS = [
        "Осмотр вертолёта",
        "Тех. задание",
        "Ремонт техники",
    ];
    const RpTaskVVSIcon = {
        "Осмотр вертолёта":"🚁",
        "Тех. задание":"📃",
        "Ремонт техники":"🔧",
    };
    const RpTaskVVSContent = {
        "Осмотр вертолёта": [
            "do Дверь закрыта.",
            "me открыла дверь",
            "me проверила состояние стекол на предмет отсутствия трещин",
            "do Трещины отсутствуют.",
            "me проверила каркас фонаря кабины экипажа на предмет отсутствия трещин",
            "do Трещины отсутствуют.",
            "me проверила внешнее состояние обшивки частей фюзеляжа на наличие трещин",
            "do Трещины и пробоины отсутствуют, заклепки закреплены.",
            "me проверила состояние амортизаторов",
            "do Амортизаторы в порядке.",
            "me проверила состояние подкосов",
            "do Подкосы в порядке.",
            "me проверила состояние колес и узлов",
            "do Колеса и узлы в порядке.",
            "me произвела осмотр промежуточного и хвостового редукторов",
            "do Редукторы в порядке.",
            "me проверила рулевой винт на исправность контровки разъемных соединений",
            "do Рулевой винт в порядке.",
            "me проверила уровень масла в осевых шарнирах",
            "do Уровень масла в норме.",
            "me открыла дверь",
            "me проверила сиденья и механизмы фиксации",
            "do Сиденья и механизмы фиксации в порядке.",
            "me проверила замки двери и блистеров",
            "do Замки двери и блистеров исправны.",
            "me закрыла дверь"
        ],
        "Тех. задание": [
            "me получил задание на ремонт",
            "do Техзадание получено.",
            "me проверил комплект инструментов",
            "do Инструменты: динамометрические ключи, торцевые головки, отвертки - полный комплект.",
            "me одел защитную экипировку",
            "do Надет: защитный комбинезон, перчатки, каска, защитные очки.",
            "me начал внешний осмотр воздушного судна",
            "me проверил состояние обшивки",
            "do Целостность фюзеляжа не нарушена.",
        ],
        "Ремонт техники": [
            "me подключил диагностический сканер",
            "do Сканер подключен, идет диагностика.",
            "me проверил показания давления",
            "do Давление в магистрали: в норме.",
            "do Обнаружена течь в соединении гидролинии №4.",
            "me заменил уплотнительные кольца",
            "do Уплотнители заменены на новые.",
            "me провел опрессовку системы",
            "do Давление  в системе нормальное.",
            "me снял панель доступа к электрощиту",
            "do Панель снята, доступ к блоку предохранителей открыт.",
            "me проверил состояние проводки",
            "do Обнаружено оплавление изоляции на кабеле.",
            "me заменил поврежденный участок кабеля",
            "do Установлен новый кабель на данном участке.",
            "me открыл капоты двигателя",
            "do Доступ к двигателю открыт.",
            "me проверил состояние лопаток вентилятора",
            "do Следов эрозии и повреждений нет.",
            "me осмотрел маслосистему",
            "do Уровень масла в норме, следов течи нет.",
            "me провел контрольный обход",
            "do Все сервисные люки закрыты, инструмент убран.",
            "me приступил к уборки  ангара после осмотра",
            "do Помещение ангара убрано, инструмент сдан на склад."
        ]
    };
    const RpTaskCCO = [
        "Чистка СВД",
        "Разминирование мины",

    ];
    const RpTaskCCOIcon = {
        "Чистка СВД":"💥",
        "Разминирование мины":"💣",
    };
    const RpTaskCCOContent = {
        "Чистка СВД": [
            "me аккуратно снимает прицел с СВД",
            "do Прицел отделен от оружия, оставаясь в руке.",
            "me открутил винты на ствольной коробке",
            "do Винты откручены и отложены в сторону.",
            "me осторожно вытащил затворную раму из ствольной коробки",
            "do Затворная рама в руке.",
            "me разобрал приклад, откручивая болты",
            "do Приклад разобран на две части.",
            "me снял цевье с оружия",
            "do Цевье отделено, оставаясь в руке.",
            "me очистил внутренние части СВД от пыли и грязи",
            "do Внутри оружия чисто.",
            "me снял затвор с помощью отвертки",
            "do Затвор отделен.",
            "me разобрал магазин, вытаскивая пружину и боевые  патроны",
            "do Магазин полностью разобран.",
            "me собрал все снятые части в аккуратную стопку",
            "do Детали лежат в порядке, готовые к сборке.",
            "me вставил затвор обратно в ствольную коробку",
            "do Затвор встал на место.",
            "me закрутил винты на ствольной коробке",
            "do Винты затянуты, оружие собрано.",
            "me установил прицел на оружие",
            "do Прицел надежно закреплен.",
            "me проверил работу механизма, нажимая на спуск",
            "do Механизм работает плавно.",
        ],
        "Разминирование мины": [
            "me развернул миноискатель ИМП-2.",
            "me установил тумблер питания в положение \"вкл\"",
            "do Тумблер питания установлен в положение \"вкл\".",
            "do Звуковой сигнал.",
            "me установил предельную чувствительность для данного типа обследуемой местности",
            "do Перемещяет миноискатель вправо-влево со скоростью 0,1 - 1 м/с.",
            "do Звуковой сигнал.",
            "do Мина обнаружена.",
            "me положил миноискатель ИМП-2 на землю",
            "do Миноискатель ИМП-2 на земле.",
            "do \"КР-и\" на плече.",
            "me снял с плеча \"КР-и\"",
            "do \"КР-и\" закрыт.",
            "me открыл \"КР-и\"",
            "me взял 1 сборный щюп и 1 катушку с черно белой лентой",
            "me начал разминирование мины",
            "try разминировал",
            "do Мина разминирована.",
            "me положил 1 сборный щюп и 1 катушку с черно белой лентой обратно в \"КР-и\"",
            "me закрыл \"КР-и\"",
            "do \"КР-и\" закрыт.",
            "me повесил на плече \"КР-и\"",
            "do \"КР-и\" на плече.",
            "me взял миноискатель ИМП-2 с земли",
            "me установил тумблер питания в положение \"выкл\"",
            "do Тумблер питания установлен в положение \"выкл\".",
            "me положил миноискатель ИМП-2 в багажник",
            "me взял аккуратно мину",
            "do Мина в руках.",
            "me положил аккуратно мину в багажник",
            "do Мина в багажнике.",
            "me положил \"КР-и\" в багажник",
            "do \"КР-и\" в багажнике."
        ],
    };
    const RPTaskGeneralContent = {
        "Разминирование мины": [
            "me развернул миноискатель ИМП-2.",
            "me установил тумблер питания в положение \"вкл\"",
            "do Тумблер питания установлен в положение \"вкл\".",
            "do Звуковой сигнал.",
            "me установил предельную чувствительность для данного типа обследуемой местности",
            "do Перемещяет миноискатель вправо-влево со скоростью 0,1 - 1 м/с.",
            "do Звуковой сигнал.",
            "do Мина обнаружена.",
            "me положил миноискатель ИМП-2 на землю",
            "do Миноискатель ИМП-2 на земле.",
            "do \"КР-и\" на плече.",
            "me снял с плеча \"КР-и\"",
            "do \"КР-и\" закрыт.",
            "me открыл \"КР-и\"",
            "me взял 1 сборный щюп и 1 катушку с черно белой лентой",
            "me начал разминирование мины",
            "try разминировал",
            "do Мина разминирована.",
            "me положил 1 сборный щюп и 1 катушку с черно белой лентой обратно в \"КР-и\"",
            "me закрыл \"КР-и\"",
            "do \"КР-и\" закрыт.",
            "me повесил на плече \"КР-и\"",
            "do \"КР-и\" на плече.",
            "me взял миноискатель ИМП-2 с земли",
            "me установил тумблер питания в положение \"выкл\"",
            "do Тумблер питания установлен в положение \"выкл\".",
            "me положил миноискатель ИМП-2 в багажник",
            "me взял аккуратно мину",
            "do Мина в руках.",
            "me положил аккуратно мину в багажник",
            "do Мина в багажнике.",
            "me положил \"КР-и\" в багажник",
            "do \"КР-и\" в багажнике."
        ],
        "Разборка/сборка пистолета": [
            "do Пистолет в кобуре.",
            "me достал пистолет из кобуры в правую руку",
            "me начал разборку пистолета",
            "do Пистолет на предохранителе.",
            "me снял пистолет с предохранителя",
            "do Магазин вставлен в пистолет.",
            "me извлек магазин из основания рукоятки",
            "me положил магазин на стол",
            "me оттянул спусковую скобу",
            "me отделил затвор от затворной рамки",
            "me положил затвор на стол",
            "do Детали пистолета лежат на столе.",
            "me положил пистолет на стол",
            "do Разобранный пистолет на столе.",
            "say Разборка завершена",
            "me взял пистолет в правую руку",
            "me ввел свободный конец возвратной пружины в канал ствола",
            "me поднял со стола затвор",
            "me присоединил затвор к рамке",
            "do Затвор вставлен в рамке.",
            "me поднял со стола магазин",
            "me вставил магазин в основание рукоятки",
            "me положил пистолет на стол",
            "do Собранный пистолет лежит на столе.",
            "me взял пистолет в правую руку",
            "me положил пистолет в кобуру",
            "do Пистолет в кобуре."
        ],
        "Разборка/сборка автомата": [
            "do Автомат на плече.",
            "me снял автомат с плеча",
            "me положил автомат на стол",
            "do Автомат на столе.",
            "me начинает разборку автомата",
            "do В автомат вставлен магазин.",
            "me отделил магазин",
            "me проверил, нет ли патрона в патроннике",
            "do В гнезде приклада вставлен пенал.",
            "me вынул пенал с принадлежностью из гнезда приклада",
            "me отделил шомпол",
            "me отделил крышку ствольной коробки",
            "me отделил возвратный механизм",
            "me отделил затворную рамку с затвором",
            "me отделил газовую трубку со ствольной накладкой",
            "do Детали от автомата на столе.",
            "me положил разобранный автомат на стол",
            "say Разборка завершена!",
            "me присоединил газовую трубку со ствольной накладкой",
            "me присоединил затворную рамку с затвором к ствольной коробке",
            "me присоединил возвратный механизм",
            "me присоединил крышку ствольной коробки",
            "me спустил курок с боевого взвода и поставила на предохранитель",
            "me присоединил дульный тормоз-компенсатор",
            "me присоединил шомпол",
            "me вложил пенал в гнездо приклада",
            "me присоединил магазин к автомату",
            "me положил автомат на стол",
            "do Автомат на столе."
        ],
        "Починка рации": [
            "do На столе лежит неисправная рация.",
            "do В руках сумка с инструментами",
            "me положил сумку на стол",
            "me перевернул рацию лицевой стороной вниз",
            "me достал из сумки крестовую отвертку",
            "me открутил все шурупы и положил их в специальную баночку",
            "me внимательно осмотрел плату",
            "todo Все ясно,контакт отошел*радостно улыбаясь",
            "me достал из сумки с инструментами паяльник и проволоку-припой",
            "me воткнул паяльник в розетку",
            "do Через 30 секунд паяльник нагрелся",
            "me взял оторванный контакт и проволоку-припой в правую руку",
            "me приложил контакт в место отрыва",
            "me расплавил кусочек проволки",
            "do Спустя 3 секунды расплавившаяся лужица застыла",
            "me выключил паяльник из розетки",
            "me положил паяльник и проволоку обратно в сумку",
            "me нажал кнопку включения на рации",
            "do Рация включилась и все ее функции были готовы к работе",
            "me достал из специальной баночки шурупчики и прикрутил заднюю крышку обратно",
            "me положил отвертку в сумку c инструментами"
        ],
        "Проверка радиоаппаратуры": [
            "do На спине рюкзак со специальным прибором \"HP8920A/B\" для проверки радиосвязи",
            "me снял рюкзак со спины и положил его на пол",
            "me тяжело вздохнув,вытащил из него тяжелый прибор",
            "me подсоединил провода с приборной панели радиоцентра в \"HP8920A/B\"",
            "do Провода подсоединены.",
            "me воткнул в розетку аппаратуру",
            "do Прибор включился",
            "do Выставил режим \"Проверка аппаратуры дуплексной связи\"",
            "do Во всплывающем окне выбрал \"В пределах от 250 кГц до 1 ГГц\"",
            "me долбанул по кнопке \"Start\"",
            "do Пошла проверка...",
            "do Проверены функции: мощность РЧ сигнала,ЗЧ сигнала,отношение СИГНАЛ/ШУМ..",
            "do ...коэффициент искажения сигнала.",
            "try все функции в норме",
            "me нажал на кнопку \"OFF\"",
            "do Прибор \"HP8920A/B\" выключился",
            "me отсоединил все провода и подсоединил их обратно в панель",
            "me засунул специальный прибор обратно в рюкзак",
            "me тяжело повесил рюкзак на плечи",
            "do Рюкзак на плечах"
        ],
        "Мытье полов": [
            "me открыл шкафчик",
            "me достал из шкафчик швабру и ведро",
            "me закрыл шкафчик",
            "do Шкафчик закрыт.",
            "me поднес ведро к крану",
            "me включил кран",
            "do Ведро наполнилось водой.",
            "me взял ведро в руку",
            "do Тряпка на швабре.",
            "me окунул швабру в ведро воды",
            "me моет пол",
            "do Тряпка сухая.",
            "me окунул швабру в ведро воды",
            "me моет пол",
            "me взял ведро в руку",
            "me вылил грязную воду в унитаз",
            "me ополоснул ведро чистой водой из под крана",
            "me открыл шкафчик",
            "me положил ведро,тряпку и швабру в шкаф",
            "me закрыл шкаф"
        ],
        "Поливка цветов": [
            "me открыл шкаф и достал лейку",
            "do Лейка в руке.",
            "me закрыл шкаф",
            "do Шкаф закрыт.",
            "me открыл кран с водой",
            "me набирает воду",
            "do Лейка наполнена водой.",
            "me поливает архидею",
            "me поливает розу",
            "me поливает фиалку",
            "me поливает алоэ",
            "me открыл шкаф и убрал лейку",
            "me закрыл шкаф",
            "do Шкаф закрыт."
        ],
        "Замена дверной ручки": [
            "do Старая дверная ручка треснута",
            "do Новая ручка в руках..",
            "me достал маленькую отвертку из кармана",
            "me открутил старую дверную ручку",
            "me распечатал новую",
            "me примерил ее на месте старой",
            "do Ручка подошла.",
            "me закрутил новую ручку",
            "me положил отвертку обратно в карман",
            "do Отвертка в кармане",
            "me начал вкручивать новую дверную ручку",
            "do Новая ручка стоит на месте старой."
        ]
    };
    const RPTaskGeneralIcon = {
        "Разминирование мины": '💣',
        "Разборка/сборка пистолета":'🔫',
        "Разборка/сборка автомата":'🔧',
        "Починка рации":'📻',
        "Проверка радиоаппаратуры":'📡',
    }
    const RPTaskGeneralList = [
        "Разминирование мины",
        "Разборка/сборка пистолета",
        "Разборка/сборка автомата",
        "Починка рации",
        "Проверка радиоаппаратуры",
    ];

    // Создаем структуру для вложенного меню ПХД
    const parkoRPTaskGeneral = [
        {
            title: "Мытье полов",
            items: RPTaskGeneralContent["Мытье полов"],
            icon: "🧹",
            type: "0" as const
        },
        {
            title: "Поливка цветов",
            items: RPTaskGeneralContent["Поливка цветов"],
            icon: "🚿",
            type: "0" as const
        },
        {
            title: "Замена дверной ручки",
            items: RPTaskGeneralContent["Замена дверной ручки"],
            icon: "🔧",
            type: "0" as const
        }
    ];
    return (
        <>
            <div className="subsection">
                <h3>🏟️ Места проведения РП задания</h3>
                <p>РП задания проводятся у ангара:</p>
            </div>
            <div className="subsection">
                <h3>📋 Список общих RP заданий для Министерства Обороны</h3>
                <div className="schedule-grid-1">
                    {RPTaskGeneralList.map((event) => (
                        <DropdownMenu
                            title={event}
                            icon={RPTaskGeneralIcon[event as keyof typeof RPTaskGeneralIcon]}
                            items={RPTaskGeneralContent[event as keyof typeof RPTaskGeneralContent] || ["Содержание будет добавлено позже"]}
                        />
                    ))}
                    <DropdownMenu
                        title="📡 Парко хозяйственный день (ПХД)"
                        items={parkoRPTaskGeneral}
                        type="1"
                        icon="🧰"
                    />
                </div>
            </div>
            <div className="subsection">
                <h3>📚 РП задания для Военной Полиции (ВП)</h3>

                <div className="space-y-3 mt-4">
                    {RpTaskVP.map((training) => (
                        <DropdownMenu
                            title={training}
                            icon={RpTaskVPIcon[training as keyof typeof RpTaskVPContent] || "📖"}
                            items={RpTaskVPContent[training as keyof typeof RpTaskVPContent] || ["Содержание будет добавлено позже"]}
                        />
                    ))}
                </div>
            </div>
            <div className="subsection">
                <h3>📚 РП задания для Военно Воздушных Сил (ВВС)</h3>

                <div className="space-y-3 mt-4">
                    {RpTaskVVS.map((training) => (
                        <DropdownMenu
                            title={training}
                            icon={RpTaskVVSIcon[training as keyof typeof RpTaskVVSContent] || "📖"}
                            items={RpTaskVVSContent[training as keyof typeof RpTaskVVSContent] || ["Содержание будет добавлено позже"]}
                        />
                    ))}
                </div>
            </div>
            <div className="subsection">
                <h3>📚 РП задания для Сил Специальных Операций (ССО)</h3>

                <div className="space-y-3 mt-4">
                    {RpTaskCCO.map((training) => (
                        <DropdownMenu
                            title={training}
                            icon={RpTaskCCOIcon[training as keyof typeof RpTaskCCOContent] || "📖"}
                            items={RpTaskCCOContent[training as keyof typeof RpTaskCCOContent] || ["Содержание будет добавлено позже"]}
                        />
                    ))}
                </div>
            </div>
            <div className="subsection">
                <h3>📂 Материалы для мероприятий</h3>
                <p>Файл с мероприятиями: <a
                    href="https://docs.google.com/document/d/1S3epu7BGhAccD75Y8nWu3Y1j4Dd30BNO14o8ATKlnfY/edit?tab=t.0"
                    className="document-link" target="_blank" rel="noopener noreferrer">Открыть документ</a></p>
            </div>
        </>
    );        
            
};

export default RPTaskSection;
